[{"category": "critical", "content_id": 28661873, "id": 1724051, "user_id": 92996, "body": "You have used the wrong units of measurement for your views!\n \nYou should use `sp` (scale-independent) unit of measurement for text size and `dp` (density-independent) for everything else. This [StackOverflow thread](http://stackoverflow.com/questions/2025282/difference-between-px-dp-dip-and-sp-in-android) is quite useful if you want more details about the differences.", "position": 90, "created_at": "2017-05-28T18:04:34.938Z", "updated_at": "2017-05-28T18:04:34.938Z"}, {"category": "nitpick", "content_id": 28661873, "id": 1724048, "user_id": 92996, "body": "Did you know that Android provides a resource file in which you can define all the colors you want to use in your app there and then you can reference them throughout your app just by using the name you defined? The main advantage is that you don't need to remember the hex color code, only the name you gave it.\n \nLet me make it clear using an example:\n \nSay you want to use the black color in some EditText widgets in your app, the hex color code for black is #000000. So, in the colors.xml resource file you can add this entry:\n \n```xml\n<color name=\"edit_text_text_color\">#000000</item>\n```\n \nOnce defined, you could reference it here like this:\n \n```xml\nandroid:textColor=\"@color/edit_text_text_color\"\n```\n \nThen, if you need to add another TextView and you want its text to be black, you can reference the same `@color/edit_text_text_color`.\n \nAfter a while, you think black is just too boring and you want to change the text colors from your EditTexts to be red, now. In this case, instead of going through each EditText element and change its color, you only need to change the hex color code in the colors.xml resource file to #FF0000:\n \n```xml\n<color name=\"edit_text_text_color\">#FF0000</item>\n```\n \nTada... now, all elements in your app that are using `edit_text_text_color` will change its color from black to green.\n \nIf you want to go into details here, you can take a look at these links:\n* https://developer.android.com/guide/topics/resources/more-resources.html#Color\n* http://android4beginners.com/2013/06/appendix-b-everything-about-colors-in-android/", "position": 46, "created_at": "2017-05-28T18:04:15.933Z", "updated_at": "2017-05-28T18:04:15.933Z"}, {"category": "nitpick", "content_id": 28661873, "id": 1724046, "user_id": 92996, "body": "It is a good practice to define all of your strings in the strings.xml resource file and refer to them wherever you need. The main advantage, in this case, is the easy addition of new language support, like Portuguese, French, Italian.  The only thing you need to do is create a strings.xml resource file for each supported language and for each key put its translation.\nRead more [here](https://developer.android.com/guide/topics/resources/string-resource.html), you can also take a look at [non-translatable strings](http://tools.android.com/recent/non-translatablestrings).", "position": 25, "created_at": "2017-05-28T18:03:58.042Z", "updated_at": "2017-05-28T18:03:58.042Z"}]