{"status": "completed", "result": "ungradeable", "grader_agent": "human", "id": 504419, "user_id": 115156, "notes": "Dear Udacity team,\r\n\r\nI am resubmitting this project for the third time and each time you are giving different review/parameter to be change. First was only two changes required, second was one changes required, and on the third most of the parameter need to be changed. Can you sync and send the actual script/parameter to be change as it will be very helpful for me in future. Thanks in advance\r\nReview 1\r\n2 specifications require changes\r\n\r\nYou did a good job so far! :+1:\r\n\r\nThere are only some minor changes that need to be addressed, I have pointed them in your code. After this, I think you are good to go. Thus, please, make the required changes and resubmit your project.\r\n\r\nKeep working hard and best of luck on your next submission!\r\n\r\nReview 2\r\nRequires Changes\r\n1 specification requires changes\r\n\r\nThe search now is working fine but the JSON parsing still has one problem. This time I gave more details to make it simpler for you to understand, I hope you'll get it.\r\n\r\nRemember, if you have any question, don't hesitate using the Discussion Forum or set up a 1:1 appointment\r\n\r\nI am looking forward to reviewing and approving your next submission! :blush:\r\n\r\nReview 3\r\nRequires Changes\r\n3 specifications require changes\r\n\r\nThis is going to be a nice app, but there is some work to do, including some cleaning up of unused variables, methods and strings...", "repo_url": null, "created_at": "2017-05-19T06:57:32.646Z", "updated_at": "2017-05-19T09:54:32.725Z", "commit_sha": null, "grader_id": 39954, "assigned_at": "2017-05-19T09:37:55.223Z", "price": "5.0", "completed_at": "2017-05-19T09:54:32.717Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/504419/BookList_Final.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/504419/BookList_Final.zip"}, "udacity_key": "4779898863484928", "held_at": null, "status_reason": null, "result_reason": "Dear student, I just reviewed the app before and I saw your note. I also asked Udacity to pass along my message (which may or may not get to you later on).\n\nFirst of all, thanks for reaching out. I know how frustrating this can be--really!\n\nSecond, Yes, we do see the prior reviews, and in this case I thoroughly reviewed them and considered them. I also considered your message referencing the Bible search (for books without authors I assume) and if you carefully read my review, you will see that none of the issues flagged are time consuming! And they are important for your understanding and for creating the best app possible, which you clearly want! \n\nI spent a long time reviewing all the lines of code in your app to understand what you did and planned to do. The notes include some sample code for you to implement. One change will take less than a minute to get done. This is a chance for a number of reviewers to weigh in when it does not pass and an opportunity for you to learn from feedback from a variety of reviewers. That is a positive and not something to complain about.\n\nSo to summarize: There are three remaining issues with the Book List app, and the good news is that they do not take much time:\n\n\n1. Removing all unused methods, variables, etc., all part of Formatting. This is a good way for you to understand your code better, because using lots of variables, strings, methods that are not really used will lead to not knowing what is going on in the app. This happens when we use other bits of code to piece an app together without full understanding. Doing this cleanup is very helpful to see her working code (by removing what is not doing anything). This should just take a few minutes per file, and should have been done prior to submitting it.\n2.  The second item that needs to be fixed is a more complete message in case no books are found. This takes less than a minute to fix, just adding a few words to the string of that error message. This was part of the rubric before, just not noticed or addressed.\n3.  The final thing was not correct before (JSON parsing) and clearly something that you thought you had fixed. You left a message about doing the \"Bible\" search (which I understand to mean a search for books without authors) and that it was all working. However, you have not coded for books without authors, and there are many! That is why  I gave you a code snippet to implement, which will take a few minutes to consider, think about and implement. Your app will be a lot better after you have that code in there.\n\nI know we want to move through the course and you are perhaps a little disappointed because you were hoping you were done, but we would not be doing our job if we did not show you how it can be better! Every reviewer is a bit different, places emphasis on different issues, and we all can overlook something, but once you make the changes, you will have a great app you can be proud of!\n\nBest of luck!", "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": null, "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 164, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 164, "user": {"name": "Selvaraja", "udacity_key": "10482968633"}, "grader": {"name": "Jay", "udacity_key": "8611198614"}, "project": {"id": 164, "name": "Book Listing"}, "rubric": {"description": "Create an app to list the published books on a given topic using the Google Books API. \n\n- - - \n\n### Before You Submit\n\nBe sure you follow the steps to prepare your project for submission, clean your build, review the project rubric, and zip your project files. \n- - - \n### Submitting Your Project\n \nTo submit your project, you will upload your zip file. \n \nOn the submission page, you'll see a **Notes to reviewer** section (image below) - \n \n![image](https://lh3.googleusercontent.com/edFd4IyrrwW3EEsm1yZC8M-aPtLX7f9pz9mhugFLn1RcnuRs0cK-Wrlh_FeZaFPleTKc74nvA8HdQhmaQQ=s0#w=1448&h=444)\n \nIn order to help project reviewers test and troubleshoot the project, please provide the devices (emulator and physical) and API level on which you tested your work. Note, providing this information does not guarantee the review will be done on the exact same device type(s); however, it will assist in providing a more efficient review experience for you as a student.\n \nYou can also provide any other additional notes to the reviewer in that section. \n- - - \n### What to Expect After Submitting\n\nIt can take us up to a week to grade the project, but in most cases it is much faster. You will get an email when your submission has been reviewed. \n\nYour reviewer will provide a code review with helpful comments and review your project against the project rubric. ", "nomination_eligible": false}}