{"status": "completed", "result": "passed", "grader_agent": "human", "id": 508871, "user_id": 71811, "notes": "Hi\r\nhere is the job description again. Thanks for your suggestion on addressing the letter to a specific person. However, I do not know how the HR manager is within the company.\r\nmany thanks\r\nRegards\r\n\r\n\r\nJob description\r\nAxiom Zen is an award-winning venture studio. We specialize in creating and reinventing businesses for a software-centric world. Our products have made “Best of the Year” lists (Apple; The Next Web), and are used by the world’s leading companies – including Adobe, Sony, Starbucks, Phillips, and SEGA. In 2015 alone, our work was featured in TIME, The New York Times, USA Today, and Wired. Our founder just made the cover of Canadian Business' 2016 \"Most Innovative Companies in Canada.”\r\n\r\nOur team of experienced software architects, engineers, and designers work on experimental, cutting-edge projects. With distributed hierarchy and an open, supportive environment, we can offer you the space to create the best work of your life.\r\n\r\nPosition Description\r\n\r\nAxiom Zen’s engineering team is committed to best practices (continuous deployment, continuous integration, automated testing, etc) and we’re looking for a talented and startup-minded AI / Machine Learning Expert to join our growing engineering team. This is a permanent and full-time position based in our office in Vancouver, Canada.\r\n\r\nThe ideal candidate will have deep knowledge of AI and machine learning technologies, software design patterns and best practices as well as a love for building user-centric products that set new standards in usability and performance. We conduct our business in English.\r\n\r\nYour Duties Will Include\r\nDesign, build, maintain and optimize our data management and machine learning architecture\r\nSolve complex problems by using algorithmic, statistical, data mining, and visualization techniques.\r\nDevelop our understanding of new data sources and how they may improve our existing processes.\r\nDesign innovative data-acquisition and labeling systems.\r\nHelp shape the direction of machine learning and artificial intelligence at Axiom Zen.\r\nLead discussions with the engineering team about technical challenges; plan and apply scalable solutions\r\nLead engineering teams to develop software based on internal and client specifications\r\n\r\n\r\nRequirements\r\nMaster’s / PhD in Engineering, Computer Science or Scientific (Mathematics, Physics and Bio-Informatics) degree.\r\n3+ years experience in a Machine Learning Researcher or Data Scientist role.\r\nMachine Learning experience working on supervised, unsupervised, semi-supervised or reinforcement learning tasks.\r\nHands-on experience in implementing a successful applied industrial software using ML techniques\r\nStrong understanding of statistical modelling, data mining, and artificial intelligence.\r\nStrong grasp of CS fundamentals, graph algorithms, data structures, and design patterns.\r\nExperience shipping high quality code in a fast-paced, mission-critical environment\r\nExperience in using deep learning frameworks (e.g. TensorFlow, Theano, Torch, …)\r\nComfortable with coding (ie. Python, Java, C, Go, or Julia)\r\nExperience with Amazon Web Services (EC2, VPS)\r\nCommitment to agile software development methodologies including TDD, continuous integration, and continuous delivery\r\nExcellent communication and team collaboration skills\r\nOutstanding written and oral communication skills in English\r\n\r\n\r\nBonus Points\r\nKnowledge and experience with Computer Vision technique, such as video processing, pattern and character recognition, or detection and tracking\r\nExperience in using big-data frameworks like Apache Hadoop and Apache Spark\r\nExperience in using GPU frameworks like CUDA\r\nFamiliarity and comfort with git and GitHub", "repo_url": null, "created_at": "2017-05-21T23:12:35.941Z", "updated_at": "2017-05-22T08:06:51.019Z", "commit_sha": null, "grader_id": 1400, "assigned_at": "2017-05-22T06:06:33.146Z", "price": "37.0", "completed_at": "2017-05-22T08:06:51.011Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/508871/submission_content.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/508871/submission_content.zip"}, "udacity_key": "4550297629360128", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "Hi Ali, \nYou rocked it! This is a very strong cover letter. It eloquently conveys your job-relevant achievements and experiences. \nAll the best for your career. :smile:", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 123, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 123, "user": {"name": "Ali", "udacity_key": "u18565096"}, "grader": {"name": "Karan", "udacity_key": "u1354003"}, "project": {"id": 123, "name": "Cover Letter Review"}, "rubric": {"description": "Job applications usually require the candidate to \"say something about themselves and why they're interested in the role.\" Sometimes, this can be as simple as a short email and sometimes it can be totally out there like a video. Most times, candidates need to submit cover letters, which is a way to connect personally with the employer in describing the candidate's passion and skills for the job.", "nomination_eligible": false}}