{"status": "completed", "result": "passed", "grader_agent": "human", "id": 508911, "user_id": 106098, "notes": null, "repo_url": "https://github.com/cassiecarr/CarND-AdvancedLaneLines-P4-1", "created_at": "2017-05-21T23:46:00.192Z", "updated_at": "2017-05-22T00:28:18.808Z", "commit_sha": "724c8b3be313e0634c39d0c9511ab487f2e5c95a", "grader_id": 41330, "assigned_at": "2017-05-21T23:56:27.105Z", "price": "72.0", "completed_at": "2017-05-22T00:28:18.805Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/508911/archive.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/508911/archive.zip"}, "udacity_key": null, "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "Awesome job with this project! You have clearly put a lot of hard work into it and it looks great! I hope the suggestions I have provided here can help you improve even more!\n\nKeep up the great work and stay Udacious!", "hidden": false, "previous_submission_id": null, "nomination": "", "language": "en-us", "rubric_id": 571, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 239, "user": {"name": "Cassandra", "udacity_key": "9856463055"}, "grader": {"name": "Kyle", "udacity_key": "u25778"}, "project": {"id": 239, "name": "Advanced Lane Finding"}, "rubric": {"description": "In this project, students will use techniques including distortion correction, image rectification, color transforms and gradient thresholding to find and track the position of the lane boundaries in a series of images (video).  This project builds on the techniques developed in the very first lane finding project, with the addition of techniques to track the position of the lane boundaries in complex conditions including curved lines, shadows, and pavement color changes.  In addition to the position of the lane lines in an image, students will report the curvature of the lines and the vehicle's position with respect to center in the lane. \n\nA detailed Reviewer's Guide [can be found here](https://docs.google.com/document/d/18CzVGqQDHOcPQn6RaR66Dr24VIwbrHDsX4j8s9TWwvM/pub?embedded=true).\n\nThe project repo can be found here: https://github.com/udacity/CarND-Advanced-Lane-Lines\n\nThe Goal of this Project\n---\nIn this project, your goal is to write a software pipeline to identify the lane boundaries in a video from a front-facing camera on a car.  The camera calibration images, test road images, and project videos are available in [the project repository](https://github.com/udacity/CarND-Advanced-Lane-Lines).  \n\nThe Writeup\n---\nThe writeup will be the primary output you submit (along with your code of course).  \n\nWithin the project repository, there is a [writeup template](https://github.com/udacity/CarND-Advanced-Lane-Lines/blob/master/writeup_template.md) that you can use as a starting point for your project writeup.\n\nA great writeup should include the rubric points as well as your description of how you addressed each point.  You should include a detailed description of the code used in each step (with line-number references and code snippets where appropriate) and links to other supporting documents or external references.  You should also include images in your writeup to illustrate how your code works.  \n\nAll that said, please be concise!  We're not looking for you to write a book, just a brief description of how you passed each rubric point, and references to the relevant code :)\n\nYou are not required to use Markdown for your writeup.  If you use another method, please just submit a PDF of your writeup.\n\nThe Code\n---\n\nYour code should stand on its own as readable material.  Explain in code comments, as well as in your writeup, how your code works and why you wrote it that way.\n\nMake it easy for a reviewer to understand your code. \n\nYou are more than welcome to use code from the lesson. But if you copy something explain how it works and why you used it. \n\nWhat It Takes to Pass\n---\n\nRead the [project rubric](https://review.udacity.com/#!/rubrics/571/view) for details on the requirements for a passing submission.  \n\nYour writeup should include each rubric point and your description of how you addressed that point in your submission.  The [project repo](https://github.com/udacity/CarND-Advanced-Lane-Lines) provides an [example template](https://github.com/udacity/CarND-Advanced-Lane-Lines/blob/master/writeup_template.md) for your writeup.\n\nThere is no starter code provided, but you are welcome to use code from the lesson and quizzes as you like.  You may complete the project in a Jupyter notebook, but it's not required.  Feel free to build it as a standalone project. \n\nTo help the reviewer evaluate your project, please save example images from each stage of your pipeline to the `output_images` folder and provide in your writeup a description of each image. Please also save your output video and include it with your submission.\n\nEvaluation\n---\n\nOnce you have completed your project, double check the [**Project Rubric**](https://review.udacity.com/#!/rubrics/571/view) to make sure you have addressed all the rubric points. Your project will be evaluated by a Udacity reviewer according to that same rubric.\n\nYour project must \"meet specifications\" in each category in order for your submission to pass.  If you are happy with your submission, then you are ready to submit! If you see room for improvement in **any** category in which you do not meet specifications, keep working! \n\n\n\n## Submission\n\n### What to Include###\n\nInclude a zipped file with your:\n\n1. writeup\n2. code (or a Jupyter notebook) \n3. example output images\n4. output video  \n\nAlternatively, you may submit a link to your GitHub repo for the project.  \n\nIn either case, **remember to include example images for each stage of your pipeline and your final output video in your submission**.\n\n### Ready to Submit?###\n\nClick on the \"Submit Project\" button and follow the instructions!\n\n\n### Using GitHub and Creating Effective READMEs\n\nIf you are unfamiliar with GitHub , Udacity has a brief [GitHub tutorial](http://blog.udacity.com/2015/06/a-beginners-git-github-tutorial.html) to get you started. Udacity also provides a more detailed free [course on git and GitHub](https://www.udacity.com/course/how-to-use-git-and-github--ud775).\n\nTo learn about REAMDE files and Markdown, Udacity provides a free [course on READMEs](https://www.udacity.com/courses/ud777), as well. \n\nGitHub also provides a [tutorial](https://guides.github.com/features/mastering-markdown/) about creating Markdown files.\n", "nomination_eligible": true}}