{"status": "completed", "result": "passed", "grader_agent": "human", "id": 511437, "user_id": 85012, "notes": null, "repo_url": null, "created_at": "2017-05-23T04:30:02.603Z", "updated_at": "2017-05-29T08:33:55.868Z", "commit_sha": null, "grader_id": 8026, "assigned_at": "2017-05-29T08:31:18.434Z", "price": "9.0", "completed_at": "2017-05-29T08:33:55.862Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/511437/a_movies__1_.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/511437/a_movies__1_.zip"}, "udacity_key": "5154614627401728", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "You've completed the first project of your Nanodegree and are well on your way to becoming a FullStack Developer! Congrats!\n\nI've written a post that includes a number of resources for learning and mastering Python. Hopefully, this will be helpful for you as you complete the rest of the NanoDegree. https://discussions.udacity.com/t/python-learning-resources/158996\n\nKeep learning and Stay Udacious :smile:", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 2, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 2, "user": {"name": "Joyi", "udacity_key": "10295277198"}, "grader": {"name": "Kirk", "udacity_key": "u26909548"}, "project": {"id": 2, "name": "Movie Trailer Website"}, "rubric": {"description": "Students will write server-side code to store a list of their favorite movies, including box art imagery and a movie trailer URL. Students will then serve this data as a web page allowing visitors to review their movies and watch the trailers. \n## How will students complete this project? \n1. Install [Python](https://www.python.org/) \n2. Create a data structure (i.e. a Python Class) to store your favorite movies, including movie title, box art URL (or poster URL) and a YouTube link to the movie trailer. \n3. Create multiple instances of that Python Class to represent your favorite movies; group all the instances together in a list. \n4. To help you generate a website that displays these movies, we have provided a Python module called [fresh_tomatoes.py](https://s3.amazonaws.com/udacity-hosted-downloads/ud036/fresh_tomatoes.py). This module has a function called **open_movies_page** that takes in one argument, which is a list of movies and creates an HTML file which visualizes all of your favorite movies. \n5. Ensure your website renders correctly when you attempt to load it in a browser. \n\n##Project Display Example \n**Note: The screenshots on this page are just examples of one implementation of the minimal functionality. You are encouraged to redesign and strive for even better solutions.** The Movie Trailer Website project consists of server-side code to store a list of movies titles, along with its respective box art imagery and movie trailer website. The data should be served as a web page allowing visitors to review the movies and watch the trailers: \n\n![Movie Trailer Home](https://i.imgur.com/StTWsH9.png) \n##Simple home page where movies are laid out\n\n![Movie Trailer](https://i.imgur.com/18cp1qa.png) \n##Page allows users to click on a movie image to watch its trailer\n\n##Student Facing Instructions \nYou will write server-side code to store a list of your favorite movies, including box art imagery and a movie trailer URL. You will then serve this data as a web page allowing visitors to review their movies and watch the trailers.\n\n## Evaluation\nYour project will be evaluated by a Udacity Code Reviewer according to the rubric below. Be sure to review it thoroughly before you submit. All criteria must \"meet specifications\" in order to pass. Furthermore a code reviewer has posted [their pre-submission checklist](https://discussions.udacity.com/t/project-1-checklist-read-this-before-you-submit-your-project/39852) on the forums, refer to it for even more detail on what reviewers look for in a project.\n\n[Click here to view the rubric](https://review.udacity.com/#!/projects/3561209451/rubric)\n\n## Submission\nWhen you're ready to submit your project, click <a target=\"_blank\" href=\"https://review.udacity.com/#!/projects/3561209451\">here</a> and follow the instructions. Due to the high volume of submissions we receive, please allow up to **7 business days** for your evaluation to be returned.\n\nIf you are having any problems submitting your project or wish to check up on the status of your evaluation, please email us at **fullstack-project@udacity.com**.\n\n## Next Steps\nYou will get an email as soon as your reviewer has feedback for you. In the meantime, review your next project and feel free to get started on it or the courses supporting it!", "nomination_eligible": false}}