{"status": "completed", "result": "failed", "grader_agent": "human", "id": 512937, "user_id": 104024, "notes": null, "repo_url": "https://github.com/pdlje82/projects", "created_at": "2017-05-23T21:22:32.535Z", "updated_at": "2017-05-23T22:23:28.725Z", "commit_sha": "fdbd35623df20c32ab8cfc118280b60d9e300560", "grader_id": 2640, "assigned_at": "2017-05-23T21:32:55.684Z", "price": "36.0", "completed_at": "2017-05-23T22:23:28.720Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/512937/archive.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/512937/archive.zip"}, "udacity_key": "6219467714592768", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "Very strong first submission! Well done! Go through the comments carefully and amend where necessary.", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 106, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 106, "user": {"name": "Jan", "udacity_key": "5419639244"}, "grader": {"name": "cydal", "udacity_key": "2183248583"}, "project": {"id": 106, "name": "Train a Smartcab to Drive"}, "rubric": {"description": "### Project Files and Description\nThe **Machine Learning Nanodegree** project files and project descriptions are available on the [Udacity MLND project GitHub](https://github.com/udacity/machine-learning).\n\n### Grading\nYou will need the `simulator.py`, `planner.py`, and `environment.py` Python files to run the student's `agent.py` Python file. You will also need the student's log files present in the attached `/logs/` folder to run the student's `smartcab.ipynb` analysis notebook.\n\nRefer to the [reviewer guidelines](https://docs.google.com/document/d/1Ofs2DLTibS98H8wisRtxlS1V_tk-crxwO6D5qs3IcT8/pub?embedded=true) and the [best practices document](https://docs.google.com/document/d/1l7kBsXt4muZe7ZP9FjyymIzXQ49EgHEHPycru1dlUA8/pub?embedded=true) for this project whenever necessary.\n\nFor the original version of the project, mark this submission as **Ungradeable** if the `agent.py` Python file or the PDF report is not present. For the newer version, mark this submission as **Ungradeable** if the `agent.py` Python file, the HTML notebook export file, or the log files are missing.\n\n### Student Instructions \nIn the not-so-distant future, taxicab companies across the United States no longer employ human drivers to operate their fleet of vehicles. Instead, the taxicabs are operated by self-driving agents — known as **smartcabs** — to transport people from one location to another within the cities those companies operate. In major metropolitan areas, such as Chicago, New York City, and San Francisco, an increasing number of people have come to rely on **smartcabs** to get to where they need to go as safely and efficiently as possible. Although **smartcabs** have become the transport of choice, concerns have arose that a self-driving agent might not be as safe or efficient as human drivers, particularly when considering city traffic lights and other vehicles. To alleviate these concerns, your task as an employee for a national taxicab company is to use reinforcement learning techniques to construct a demonstration of a **smartcab** operating in real-time to prove that both safety and efficiency can be achieved.\n\n### Project Files\nFor this assignment, you can find the `smartcab` folder containing the necessary project files on the [Machine Learning projects GitHub](https://github.com/udacity/machine-learning), under the `projects` folder. You may download all of the files for projects we'll use in this Nanodegree program directly from this repo. Please make sure that you use the most recent version of project files when completing a project!\n\n### Evaluation\nYour project will be reviewed by a Udacity reviewer against the **<a href=\"https://review.udacity.com/#!/rubrics/106/view\" target=\"_blank\">Train a Smartcab to Drive project rubric</a>**. Be sure to review this rubric thoroughly and self-evaluate your project before submission. All criteria found in the rubric must be *meeting specifications* for you to pass.\n\n### Submission Files\nWhen you are ready to submit your project, collect the following files and compress them into a single archive for upload. Alternatively, you may supply the following files on your GitHub Repo in a folder named `smartcab` for ease of access:\n- The `agent.py` Python file with all code implemented as required in the instructed tasks.\n- The `/logs/` folder which should contain **five** log files that were produced from your simulation and used in the analysis.\n- The `smartcab.ipynb` notebook file with all questions answered and all visualization cells executed and displaying results.\n - An **HTML** export of the project notebook with the name **report.html**. This file *must* be present for your project to be evaluated.\n\n### I'm Ready!\nWhen you're ready to submit your project, click on the **Submit Project** button at the bottom of this page.\n\nIf you are having any problems submitting your project or wish to check on the status of your submission, please email us at **machine-support@udacity.com** or visit us in the <a href=\"http://discussions.udacity.com\" target=\"_blank\">discussion forums</a>.\n\n### What's Next?\nYou will get an email as soon as your reviewer has feedback for you. In the meantime, review your next project and feel free to get started on it or the courses supporting it!", "nomination_eligible": false}}