{"status": "completed", "result": "passed", "grader_agent": "human", "id": 513276, "user_id": 137622, "notes": "Alteração feita! Obrigada!", "repo_url": null, "created_at": "2017-05-24T00:53:36.315Z", "updated_at": "2017-05-24T01:15:43.775Z", "commit_sha": null, "grader_id": 117161, "assigned_at": "2017-05-24T01:10:34.661Z", "price": "9.0", "completed_at": "2017-05-24T01:15:43.759Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/513276/submission_content.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/513276/submission_content.zip"}, "udacity_key": null, "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": ["https://udacity-reviews-uploads.s3.amazonaws.com/_ann/513276/1495588470/Kami_Export_-_PDF_of_P1_Submission_Template__PT-BR__KARINA_vrevisada-_Documentos_Google.pdf"], "general_comment": "Parabéns! Você fez um bom trabalho :)", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "pt-br", "rubric_id": 857, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 263, "user": {"name": "Karina", "udacity_key": "10613375332"}, "grader": {"name": "Marcos", "udacity_key": "10520560732"}, "project": {"id": 263, "name": "Prepare to Market"}, "rubric": {"description": "# ATENÇÃO: [Novo Guia do Revisor](https://docs.google.com/presentation/d/1XGFvFTHfk1jLGs1XjmmpJ4g9C8bpMfDm_fjgcl7CCeg/edit?usp=sharing) e [Template do Projeto](https://docs.google.com/presentation/d/1Bk14OtvWW67qJ0H63jtd8P5xcySgyDCOMB0LhDfhALU/edit?usp=sharing)\n\n\nCurso: O poder do Marketing Digital\nTipo de arquivo:  PDF\nTempo estimado de revisão: 15 minutos\n\nDescrição: Elaborar o modelo de negócios, objetivo de Marketing e KPI primário; escrever uma proposta de valor e desenvolver a persona do cliente.\n\n## Veja aqui as instruções para o aluno, como referência: \nPara seus projetos no programa de Marketing Digital, você utilizará um desafio de Marketing focado em um produto B2C.\n\n### Desafio de Marketing: programa Nanodegree Marketing Digital\n\nVocê está encarregado de atrair futuros alunos ao programa Nanodegree Marketing Digital. Mais especificamente, seu objetivo é coletar o e-mail de potenciais alunos que poderiam se interessar em fazer este curso. Para isso, criamos uma página onde os alunos em potencial podem baixar gratuitamente um eBook se nos fornecerem seu e-mail. O eBook – um Guia de publicidade social – é um pequeno resumo do programa Nanodegree Marketing Digital, conteúdo que você verá no curso de Publicidade em mídias sociais.\n \nPara uso nos projetos, assuma um custo de R$ 0 para o eBook e um valor de conversão (receita) de R $15 por e-mail coletado.\n \n \n### Modelo do projeto\nFaça uma cópia do [modelo do projeto no Google Docs](https://docs.google.com/presentation/d/1Bk14OtvWW67qJ0H63jtd8P5xcySgyDCOMB0LhDfhALU/edit?usp=sharing) e preencha todas as seções. Após concluir o projeto, certifique-se de guardar o documento em seu ambiente de trabalho. Você precisará converter suas respostas em um PDF para enviá-las (mais instruções abaixo).\n\n \n \n## Projeto 1: Prepare-se para o mercado\n \nFaça uma cópia do [modelo do projeto no Google Docs](https://docs.google.com/document/d/1Ab1HNf3eyzyTfisLaXE7yAFuohYtaaan4R1NyhUZlJ0/edit?usp=sharing) e preencha todas as seções conforme as instruções.\n \n \n### Etapa 1: Introdução\n \n1. Descreva a Udacity, seus produtos e seu modelo de negócio (não mais de 250 palavras).\n2. Informe o objetivo de Marketing do produto.\n3. Qual é o seu principal KPI para medir o sucesso do Marketing?\n \n### Etapa 2: Proposta de valor\n \nEscreva uma proposta de valor usando o modelo de Geoffrey Moore:\n \nPara (cliente-alvo), o qual (declaração da necessidade ou oportunidade), nosso (produto/serviço) é (categoria de produto) que (declaração de benefício). Diferentemente (concorrente mais próximo), nossa oferta (diferenciação primária).\n \nCaso precise de mais inspiração, veja mais sobre propostas de valor no [HubSpot](http://blog.hubspot.com/marketing/write-value-proposition#sm.00000vzhym4ojre13rlj7cs9ot3fn).\n \n### Etapa 3: Persona do cliente\n \n1. Pesquise quem você acha que são os prováveis clientes. Resumidamente, descreva a pesquisa que você realizou (não mais de 250 palavras).\n \n2. Entreviste 3 clientes potenciais e forneça o nome de cada um deles abaixo.\n \n3. Reúna as informações de suas entrevistas, crie **uma única persona de cliente**, preenchendo cada seção da tabela, e inclua pelo menos três itens por campo, onde indicado.\n \n \n \n![persona do cliente](https://d17h27t6h515a5.cloudfront.net/topher/2017/February/58ac88ce_screen-shot-2017-02-21-at-10.31.35-am/screen-shot-2017-02-21-at-10.31.35-am.png)\n \n### Envio\nPor fim, não se esqueça de converter suas respostas em um PDF e enviá-las abaixo. É fácil converter um documento do Microsoft Word em PDF em um [PC](https://support.office.com/en-gb/article/Save-or-convert-to-PDF-d85416c5-7d77-4fd6-a216 -6f4bf7c7c110) ou [Mac](https://support.office.com/en-us/article/Save-or-convert-to-PDF-on-your-Ma-aa183751-1f09-4b8b-88a4-099a0c7528da). Se utilizar o Google Docs, basta clicar em Arquivo >> Baixxar como... >> e escolher PDF.\n \n### Rubrica\nVocê pode consultar a [rubrica deste projeto](https://review.udacity.com/#!/rubrics/857/view) para analisar o que ele deve incluir.\n\n## Conceitos e recursos adicionais\n\n### Componentes do negócio\n\nOs principais componentes do negócio\n\n* As **fontes de receita** - como você ganha dinheiro? Quanto você cobra? \n* Os **custos** - quanto custou para produzir ou oferecer seu produto ou serviço?\n*O **produto ou serviço** - o que é isso? Como ele beneficia os clientes?\n*Os **clientes** - quem são eles? Tratam-se de consumidores, empresas ou ambos? Eles interagem com você online, offline ou de ambas as maneiras? \n\n### Modelos de negócio \nModelos de negócios podem ser complexos, mas, em sua essência, eles definem como uma empresa agrega valor. As empresas B2C vendem produtos ou serviços aos clientes. A Betabrand é uma empresa de comércio eletrônico. Ela vende roupas femininas e masculinas por meio de um site. É considerada uma empresa para o consumidor, ou empresa B2C.\n\n\nAs empresas B2B fazem vendas para outras empresas. As vendas são, geralmente, de grandes produtos ou serviços. A BambooHR vende software de RH para pequenas e médias empresas. É considerada uma empresa para o empresas, ou B2B.\n\n### Objetivo de marketing\n \n**Objetivos SMART**\n\n***S**PECIFIC (específico)\n* **M**EASURABLE (mensurável)\n* **A**CHIEVABLE (atingível)\n* **R**ELEVANT (relevante)\n* **T**IME PHASED (tempo definido)\n\nO **objetivo de marketing** é, basicamente, o que você deseja atingir com os esforços de marketing. Você pode ter um ou vários objetivos de marketing. Exemplos de objetivos de marketing são: construir uma marca, gerar leads, gerar vendas ou aumentar o volume existente, converter leads em vendas, aumentar a fidelidade do cliente\n\n### KPI\n\n**Key** - importante \n**Performance** - como você está se saindo\n**Indicador** - geralmente, uma métrica ou um valor\n\nKPI - um Key Performance Indicator - indicador principal de desempenho - é uma maneira (um indicador) de dizer como está seu desempenho, se comparado ao seu objetivo - algo que é importante para você. Os KPIs de marketing são o elo entre suas atividades e objetivos de marketing. Muitos profissionais de marketing, muitas vezes, usam o termo métrica no lugar de KPI. Neste curso, utilizaremos o conceito de um KPI principal - a atividade principal que você está medindo - separadamente das métricas que podem apoiá-lo. Alguns dos KPIs de marketing são: retorno sobre o investimento (ou ROI) de marketing, número de vendas adicionais, número de leads, net promoter score (NPS) e nota do engajamento aos e-mails.\n\n### Proposta de valor\n\nUma proposta de valor abrange:\n* o que você está vendendo\n* qual é o benefício obtido\n* quem é o cliente-alvo de seu produto ou serviço\n* o que diferencia sua oferta da dos concorrentes - o que a torna única\n\nO guru do marketing Geoffrey Moore popularizou as propostas de valor em seu livro, Crossing the Chasm (em tradução livre, Cruzando o abismo). Este é o modelo de uma proposta de valor.  É um modelo muito simples, que pode ajudar você a esclarecer a proposta de valor de sua empresa. \n\nModelo de Geoffrey Moore: **Para** (cliente-alvo), **o qual** (declaração da necessidade ou oportunidade), **nosso** (produto/serviço) é (categoria de produto) **que** (declaração de benefício). **Diferentemente** (da do concorrente mais próximo), **nossa oferta** (diferenciação primária).\n\n### Exemplos: \nÉ claro que cada pessoa expressa sua proposta de valor de forma um pouco diferente, mas, em sua essência, ela sempre deve abranger todos os seis componentes acima.\n\nA proposta de valor da Betabrand pode ser:\n**PARA** clientes que acompanham as tendências\n**O QUAL** (os quais) precisam de roupas que se adaptem a seu estilo de vida agitado\n**NOSSO** (nossa) loja online de roupas\n**QUE** oferece roupas criadas pela comunidade\n**DIFERENTEMENTE** da de sites como o Teespring\n**NOSSA OFERTA** inclui todos os tipos de roupas inovadoras, criadas do zero pela comunidade\n\nA proposta de valor da Ezequiel Farca pode ser:\n**PARA** clientes que se importam com design\n**O QUAL** (os quais) precisam de uma casa personalizada, projetada de acordo com seu gosto e suas necessidades\n**NOSSO** (nossos) serviços de arquitetura e design\n**QUE** oferecem um design moderno de ponta\n**DIFERENTEMENTE** da de escritórios de arquitetura, como o WRNS Studio\n**NOSSA OFERTA** equilibra uma arquitetura moderna e harmoniosa a nossos móveis e design de interior premiados\n\nCaso precise de mais inspiração, veja mais sobre propostas de valor no [HubSpot](http://blog.hubspot.com/marketing/write-value-proposition#sm.00000vzhym4ojre13rlj7cs9ot3fn). \n\n### Persona do cliente\n\n### Mapa de empatia\nPara entender os usuários, os designers criaram mapas de empatia para resumir as pesquisas de consumidor.  Atualmente, a maioria dos profissionais de marketing digital os usa para compreender seus clientes. A maioria dos mapas de empatia tem quatro quadrantes, divididos em \"pensar\", \"ver\", \"fazer\" e \"sentir\". Para começar a construir seu mapa de empatia, você precisa conhecer seus clientes, usando uma combinação de entrevistas, visitas a clientes em seu ambiente e dados obtidos em outras pesquisas. \n\nVocê coleta todas as informações geradas e as anota em adesivos, colocando cada adesivo em um quadrante. Em seguida, coloque-se no lugar dos clientes com quem você conversou e resuma suas descobertas. O que eles pensam e sentem? O que eles ouvem? O que eles veem? O que eles dizem e fazem? \n\nSempre que possível, liste as palavras e frases que seus clientes dizem, os aplicativos que usam, os sites que visitam, e assim por diante. As informações coletadas aqui serão extremamente úteis para a definição de suas mensagens e seleção de canais de marketing.\n\nAssim que tiver os mapas de empatia, você estará pronto para criar uma persona. A persona é um personagem fictício que resume e comunica as principais características de seu cliente-alvo.  Para definir as características dessa persona, você usará as informações dos mapas de empatia. \n\n### Persona do cliente\nCriar essa persona é útil porque sempre lembra a você quem é seu cliente.  Ela também permite que todas as pessoas da empresa tenham a mesma imagem de seu cliente. \n\nEste modelo é útil para a descrição de sua persona.  Primeiro, você define o histórico, os dados demográficos e passatempos; depois, explica os objetivos da sua persona. Você também deve descrever as necessidades e os obstáculos que ela enfrenta.  Uma boa ideia é dar um nome descritivo à essa persona e adicionar uma foto, definindo sua aparência.  Isso ajuda a exibir melhor a imagem da persona. \n\nNo HubSpot, você encontra [mais exemplos de personas] (https://blog.hubspot.com/marketing/buyer-persona-examples#sm.0001l6650q2kfedtyih24xsgjv28t).", "nomination_eligible": false}}