{"status": "completed", "result": "failed", "grader_agent": "human", "id": 513490, "user_id": 137262, "notes": "You must submit BOTH a cover letter and resume to be considered for this role. In your cover letter, please describe any experience that you feel best demonstrates your relevancy for this particular role.\r\nM&C Saatchi Mobile is a leading, global, full service mobile-first digital media agency. We help brands engage with their customers using creative and effective mobile advertising solutions. The agency has been ideating, implementing and optimizing award winning Digital, Social, and Mobile media campaigns for over a decade to a top-tier portfolio of clients including Tech, eCommerce and consumer brands.\r\n\r\n\r\n\r\nWe are seeking a Junior Data Analyst to provide analytic support and strategic recommendations to clients and the internal media teams. If you are analytically-minded, with an eye for numbers, attention to detail, and an interest/understanding of media, this is a phenomenal opportunity with a forward-thinking company.\r\n\r\nWorking under a Data Analyst and alongside other teams at M&C Saatchi Mobile, the Junior Data Analyst will assist the Strategy group and several client teams with all data-oriented aspects of the research, planning, and insight mining related to various market climates and consumer behaviors.\r\n\r\nQuantitative analyses derived from a wide swath of sources plays a crucial role in providing accurate recommendations. Similarly, detailed reporting provided during and after campaigns ensures we stay on track to reach our goals and help shape the story for all future planning.\r\n\r\nThe Junior Data Analyst will work with the guidance of a Data Analyst to interface and provide support to the media, strategy, and App Store Optimization (ASO) teams, as well as select clients. The Junior Data Analyst will receive ample training and opportunities to gain comfort in operating independently, providing proactive analyses and acting as a strong individual contributor.\r\n\r\nDuties And Responsibilities\r\n\r\nPerform detailed data analysis of multiple media campaign results to create constant improvement in delivery against KPIs.\r\nCollaborate with the media and strategy teams, data providers/vendors, and clients\r\nWork with team to perform ongoing analysis using Excel, Google Analytics, Ad Servers, etc. to ensure the timely adjustment/optimization of campaigns, along with other client-specific analyses (such as campaign analysis, customer segmentation and profiling and competitive market research)\r\nBuild a body of knowledge on digital media, technology and strategy performance with the objective of informing future media decisions on schedules, budgets, partners and strategies\r\nAssist in building presentations for campaign reports and new business pitches\r\nRequired Experience/Ability\r\n\r\n1-2 years of experience within an analytics function\r\nStrong analytical skills and Experience with data analysis to develop insights\r\nAdditional Skills\r\n\r\nUnderstanding of statistics (Experience with R, SAS, or SPSS is a plus)\r\nKnowledge of data visualization techniques for data analysis and presentation\r\nKnowledge of digital media, especially mobile and app store\r\nUnderstanding of attribution, data collection, targeting and privacy are a plus\r\nMust feel comfortable learning new systems and tools", "repo_url": null, "created_at": "2017-05-24T03:06:06.299Z", "updated_at": "2017-05-24T04:36:44.237Z", "commit_sha": null, "grader_id": 8184, "assigned_at": "2017-05-24T03:16:20.625Z", "price": "22.0", "completed_at": "2017-05-24T04:36:44.231Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/513490/submission_content.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/513490/submission_content.zip"}, "udacity_key": "5670684308144128", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "Great job on your submission! There are a few things to work on but overall, I'm very pleased with your progress!", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 53, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 53, "user": {"name": "Raul", "udacity_key": "10468994565"}, "grader": {"name": "Joshwa", "udacity_key": "4362589395"}, "project": {"id": 53, "name": "Resume Review (Entry-level)"}, "rubric": {"description": "A job candidate would have an entry-level resume if they had 0-3 years of experience. This includes recent college grads, someone looking for their first job, someone who's had a couple jobs but the roles had all been entry-level, etc.\n\nThe candidate needs to prove, most of all, that they can function in a work environment.\n\n## Submission Instructions\n\n\n**To submit this project, you must include the text of a job description in \"Notes to reviewer\".**\n\n1. **[Find a job posting](https://career-resource-center.udacity.com/job-boards)** that you would apply to now or after your Nanodegree graduation. Judge if you would be a good fit for the role. *(Note: If you're more than 75% qualified for the job on paper, you're probably a good candidate and should give applying a shot!)*\n2. Refine your resume to **target it to that job posting.**\n3. **Copy and paste** the **text** of the job posting in \"Notes to reviewer\" during submission. Do not copy the job posting link, which can expire at any time.\n4. *Optional:* Remove any sensitive information, such as your phone number, from the submission.\n5. Submit your targeted resume as a .pdf.\n\n## Career Counselors\nRemember that career counselors are always available to help you on your job search. Make an appointment with them [here](https://calendly.com/career-coach).", "nomination_eligible": false}}