{"status": "completed", "result": "passed", "grader_agent": "human", "id": 513544, "user_id": 9431, "notes": null, "repo_url": null, "created_at": "2017-05-24T03:42:35.136Z", "updated_at": "2017-05-24T12:31:27.785Z", "commit_sha": null, "grader_id": 2150, "assigned_at": "2017-05-24T03:52:53.978Z", "price": "40.0", "completed_at": "2017-05-24T12:31:27.778Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/513544/StephenChu_IntroML_Project.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/513544/StephenChu_IntroML_Project.zip"}, "udacity_key": "6069843402031104", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "### Awesome\n\nCongratulations on meeting all specifications! This is definitely a challenging project to pass.  So hats off to you for passing it!  \n\nThe Enron Corpus is a very useful dataset used for solving a range of natural language processing tasks, like sentiment analysis.  The dataset that was provided for this project is a processed version of the [original corpus](https://www.cs.cmu.edu/~./enron/).  The dataset is also hosted on Kaggle.  Here's the link: https://www.kaggle.com/wcukierski/enron-email-dataset.  You can definitely take a look at the work other people have done with this dataset by clicking on [kernels](https://www.kaggle.com/wcukierski/enron-email-dataset/kernels).\n\nGood luck with the rest of the program!", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 27, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 27, "user": {"name": "StephenC", "udacity_key": "4290459495"}, "grader": {"name": "Donald", "udacity_key": "723769955"}, "project": {"id": 27, "name": "Identify Fraud from Enron Email"}, "rubric": {"description": " It is important to read carefully these [reviewer instructions for the project](https://docs.google.com/document/d/1tK3JdHJe9sBP7W7aRYE5yszhfVIdG0w6JIu3ohrAjlM/pub?embedded=True).\n\nYou should also read these [example projects and reviews](https://www.dropbox.com/sh/13iklukn0khedak/AABI0qdlZujmm7gJzV9CyfW8a?dl=0) as you learn about reviewing this project.\n\n-----\n\nPlay detective and put your machine learning skills to use by building an algorithm to identify Enron Employees who may have committed fraud based on the public Enron financial and email dataset.\n\n## General Submission and Evaluation Overview\n\nYour submission will contain several files: the code/classifier you create and some written documentation of your work.  We will evaluate your project according to the rubric [here](https://review.udacity.com/#!/projects/3174288624/rubric); only projects that satisfy **all** \"meets expectations\" items will pass.  **Please self-evaluate before you submit!**  If you don't think your project meets all the criteria, the project evaluator likely won't either.  \n\n## Submission\n\nReady to submit your project?  Go back to your Udacity Home, click on the project, and follow the instructions to submit!\n\n* You can either send us a GitHub link of the files or upload a compressed directory (zip file).  \n* Inside the zip folder include a text file with a list of Web sites, books, forums, blog posts, GitHub repositories etc that you referred to or used in this submission (Add N/A if you did not use such resources).\n\nIt can take us up to a week to grade the project, but in most cases it is much faster. You will receive an email when your submission has been reviewed.\n\nIf you are having any problems submitting your project or wish to check on the status of your submission, please email us at dataanalyst-project@udacity.com.\n\n### Items to include in submission:\n\n### Code/Classifier\nWhen making your classifier, you will create three pickle files (`my_dataset.pkl`, `my_classifier.pkl`, `my_feature_list.pkl`). The project evaluator will test these using the `tester.py` script. You are encouraged to use this script before submitting to gauge if your performance is good enough. You should also include your modified `poi_id.py` file in case of any issues with running your code or to verify what is reported in your question responses (see next paragraph). Notably, we should be able to run `poi_id.py` to generate the three pickle files that reflect your final algorithm, without needing to modify the script in any way.\n\nIf you have intermediate code that you would like to provide as supplemental materials, it is encouraged for you to save them in files separate from `poi_id.py`. If you do so, be sure to provide a readme file that explains what each file is for. If you used a Jupyter notebook to work on the project, make sure that your finished code is transferred to the `poi_id.py` script to generate your final work.\n\n### Documentation of Your Work\nDocument the work you've done by answering (in about one or two paragraphs each) the questions found [here](https://docs.google.com/document/d/1NDgi1PrNJP7WTbfSUuRUnz8yzs5nGVTSzpO7oeNTEWA/pub?embedded=true).  You can write your answers in a PDF, text/markdown file, HTML, or similar format.  The responses in your documentation should allow a reviewer to understand and follow the steps you took in your project and to verify your understanding of the methods you have performed.\n\n### Text File Listing Your References \nA list of Web sites, books, forums, blog posts, github repositories etc. that you referred to or used in this submission (add N/A if you did not use such resources). \nPlease carefully read the following statement and include it in your document “I hereby confirm that this submission is my work. I have cited above the origins of any parts of the submission that were taken from Websites, books, forums, blog posts, github repositories, etc.\n\n### Good Luck!", "nomination_eligible": false}}