{"status": "completed", "result": "passed", "grader_agent": "human", "id": 531418, "user_id": 23461, "notes": null, "repo_url": null, "created_at": "2017-06-03T01:12:41.491Z", "updated_at": "2017-06-03T02:24:20.770Z", "commit_sha": null, "grader_id": 17047, "assigned_at": "2017-06-03T01:25:37.541Z", "price": "18.0", "completed_at": "2017-06-03T02:24:20.767Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/531418/Tableau.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/531418/Tableau.zip"}, "udacity_key": null, "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "Dear student, I want to congratulate you for completing this project and fixing the issues addressed in the previous reviews. I enjoyed reviewing your project and wish you success in your future work!\nKeep it up doing your awesome job!", "hidden": false, "previous_submission_id": null, "nomination": "", "language": "en-us", "rubric_id": 948, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 303, "user": {"name": "adam", "udacity_key": "4631581590"}, "grader": {"name": "Raman", "udacity_key": "5393560208"}, "project": {"id": 303, "name": "Create a Tableau Story"}, "rubric": {"description": "Students will create a data visualization from a data set that tells a story or allows a reader to explore trends or patterns. Students will need to use Tableau to create the visualization. Student work should be a reflection of the theory and practice of data visualization, such as visual encodings, design principles, and effective communication.\n\nPlease look at the [reviewer instructions for this project here](https://docs.google.com/document/d/12tThE_HBji--vtbNmMXapeYTCBypoCI-27vKwLdD8rs/pub?embedded=true) before you start reviewing.\n\n-----\n\nCreate a data visualization from a data set that tells a story or highlights trends or patterns in the data. Use Tableau to create the visualization. Your work should be a reflection of the theory and practice of data visualization, such as visual encodings, design principles, and effective communication.\n\n## Evaluation\n\nUse the <a href=\"https://review.udacity.com/#!/projects/3184238632/rubric\" target=\"_blank\">**Project Rubric**</a> to review your project. If you are happy with your submission, then you are ready to submit! If you see room for improvement in **any** category in which you do not meet specifications, keep working!\n\nYour project will be evaluated by a Udacity reviewer according to the same <a href=\"https://review.udacity.com/#!/projects/3184238632/rubric\" target=\"_blank\">**Project Rubric**</a>. Your project must \"meet specifications\" or \"exceed specifications\" in each category in order for your submission to pass.\n\n### Reminders\n\n- Your visualization work should use Tableau: other visualization tools may not be evaluatable by reviewers.\n- Remember that your visualization should be explanatory in nature and communicate specific results that you want to show.\n\n## Submission\n\nReady to submit your project?  Click on the \"Submit Project\" button or go back to your Udacity Home and click on the project, then follow the instructions to submit!\n\n* Send a PDF or Markdown writeup that includes links to online published Tableau files\n* Include a text file or a section in your writeup with a list of Web sites, books, forums, blog posts, GitHub repositories etc that you referred to or used in this submission (Add N/A if you did not use such resources).\n\nIt can take us up to a week to grade this project, but in most cases it is much faster. You will receive an email when your submission has been reviewed. \n\nIf you are having any problems submitting your project or wish to check on the status of your submission, please email us at dataanalyst-project@udacity.com.\n\n## What to include in your submission?\n\n1. the PDF or Markdown write up with the sections Summary, Design, Feedback, and Resources\n2. the link to the Tableau Public file for the first version of your story (e.g. story_v1)\n3. the link to the Tableau Public file for the final version of your story (e.g. story_final)\n4. the final data set file used for the graphic (usually .csv)\n5. a list of  Web sites, books, forums, blog posts, github repositories, etc. that you referred to or used in creating your submission (add N/A if you did not use any such resources).", "nomination_eligible": true}}