{"status": "completed", "result": "failed", "grader_agent": "human", "id": 534879, "user_id": 139790, "notes": "Thanks for reviewing my work. If there are any error in my project, I would like to correct it.", "repo_url": null, "created_at": "2017-06-05T03:08:43.129Z", "updated_at": "2017-06-06T03:06:03.819Z", "commit_sha": null, "grader_id": 2858, "assigned_at": "2017-06-05T16:00:13.050Z", "price": "35.0", "completed_at": "2017-06-06T03:06:03.813Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/534879/OpenStreetMap_Project.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/534879/OpenStreetMap_Project.zip"}, "udacity_key": "5154932897480704", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "The project is already very well done and only requires some small tweaks required by the project guidelines.  I have made suggestions in the appropriate evaluation field.  Once these areas are addressed, the project should be complete and ready for portfolio submission.  Keep up the great work, you are almost there!\n \n>\"Genius is one percent inspiration and ninety-nine percent perspiration.\"\n \n-- Thomas Alva Edison", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 25, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 25, "user": {"name": "Xiangzi", "udacity_key": "10398977735"}, "grader": {"name": "Miadad", "udacity_key": "1222819468"}, "project": {"id": 25, "name": "Wrangle OpenStreetMap Data"}, "rubric": {"description": "Students will choose any area of the world in [OpenStreetMap](https://www.openstreetmap.org) and use data munging techniques, such as assessing the quality of the data for validity, accuracy, completeness, consistency and uniformity, to clean the OpenStreetMap data for a part of the world that they care about.\n\n**Please look at [detailed instructions for reviewing here](https://docs.google.com/document/d/1J5fFcqS4cmYN6Qs2q3ebZ5XwoBhZTLtLbSC1zgbYcYY/pub?embedded=True).**\n\nChoose any area of the world in https://www.openstreetmap.org and use data munging techniques, such as assessing the quality of the data for validity, accuracy, completeness, consistency and uniformity, to clean the OpenStreetMap data for a part of the world that you care about. Choose to learn SQL or MongoDB and apply your chosen schema to the project.\n\n## Evaluation\nA Udacity evaluator will review and check your completion of the problem sets in your choice of MongoDB or SQL, as well as your answers to the questions listed in the rubric below. Be sure to complete all of questions in the problem sets and the rubric before submitting your project. \n\n### Rubric\nYour project will be evaluated by a Udacity reviewer according to this <a href=\"https://review.udacity.com/#!/projects/3168208620/rubric\" target=\"_blank\">Project Rubric</a>. Be sure to review it thoroughly before you submit. Your \"project meets specifications\" if it meets specifications in all the criteria. If you see room for improvement in **any** category in which you do not meet specifications, be sure to take some time to revise your work until you feel it is up to expectations.\n\n## Submission\nReady to submit your project?  Collect the following files: \n<ol>\n<li>A pdf or html document containing your answers to the rubric questions. This file should document your data wrangling process. </li>\n<li>Your Python code you used in auditing and cleaning your dataset for the final project. You may also include the original Case Study scripts, but make sure it is clear which code was used for the project, and which applies to the lesson quizzes. We recommend including a Readme file to describe the contents of each file you include in your submission.</li>\n<li>A text file containing a link to the map position you wrangled in your project, a short description of the area and a reason for your choice.</li>\n<li>An .osm file containing a sample part of the map region you used (around 1 - 10 MB in size). See the notes below.</li>\n<li>A text file containing a list of  Web sites, books, forums, blog posts, github repositories etc that you referred to or used  in this  submission (Add N/A if you did not use  such resources).</li>\n</ol>\n\n### Common mistakes and warnings\n\n- If you've been working on this project through a Jupyter Notebook, make sure that your code is transferred to standalone .py scripts before submitting your work. It is recommended that you have one script for each field that you audit, and one script that converts and cleans your data. Make sure that your code is well-commented and organized so that your reviewer can follow your work.\n- Make sure that your scripts carry out the functionality of your cleaning steps. One common mistake is to create scripts that target specific audits of the code, but the audited changes are not actually carried out when the XML data is converted to JSON or CSV for insertion into your chosen database.\n\n### Ready to submit your project?\n\nClick on the \"Submit Project\" button, or click on the project from your Udacity Home, and follow the instructions to submit:\n\n* If you want to submit your files through a \"Link to Project\", upload your project files onto Github and send us the link.\n* If you instead want to submit your files through \"Upload a Zip\", compress your project directory, and submit that zip file.\n\nIt can take us up to a week to grade the project, but in most cases it is much faster. You will get an email once your submission has been reviewed.\n\nIf you are having any problems submitting your project or wish to check on the status of your submission, please email us at dataanalyst-project@udacity.com.\n", "nomination_eligible": false}}