{"status": "completed", "result": "passed", "grader_agent": "human", "id": 540429, "user_id": 139408, "notes": "Hi! Thanks for pointing that out. I used the independent-sample formula to get the standard error. I highlighted corrected answers in green.", "repo_url": null, "created_at": "2017-06-08T03:19:09.483Z", "updated_at": "2017-06-08T03:53:47.677Z", "commit_sha": null, "grader_id": 14522, "assigned_at": "2017-06-08T03:47:06.132Z", "price": "12.0", "completed_at": "2017-06-08T03:53:47.672Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/540429/pthivierge_statistics.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/540429/pthivierge_statistics.zip"}, "udacity_key": "5662207726714880", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "Well done!\n\nYou project is really good and all calculations and definitions are precise!\n\n**Congratuations!:clap::clap:**", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 71, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 71, "user": {"name": "Pascal", "udacity_key": "10628294559"}, "grader": {"name": "Peterson", "udacity_key": "u6436745"}, "project": {"id": 71, "name": "Test a Perceptual Phenomenon"}, "rubric": {"description": "Please read the [reviewer instructions here](https://docs.google.com/document/d/1Qq5-8s1mPb3PFVUbu10-gmixGZDeFyz5vE482NNj6jw/pub?embedded=true).\n\nUse descriptive statistics and a statistical test to analyze the Stroop effect, a classic result of experimental psychology. Give your readers a good intuition for the data and use statistical inference to draw a conclusion based on the results. <em>Use the  <a href=\"https://www.udacity.com/course/viewer#!/c-ud134-nd/l-4446458586/\" target=\"_blank\">Statistics Placement Advisor</a> to determine if reviewing any of the Statistics course will help you prepare for this project.</em>\n\n## Evaluation\n\nOnce you have a document answering the questions on the previous page, be sure to check through the <a href=\"https://review.udacity.com/#!/projects/4582204201/rubric\" target=\"_blank\">project rubric</a> before you submit your report. Your project will be evaluated as “meets specifications” only if it meets specifications in all the criteria. If you see any category where you do not meet specifications, make sure you revise your report to meet the rubric criteria.\n\n## Submission\n\nReady to submit your project? Collect the following files:\n\n* Answers to the questions on the previous page in a pdf or html document.\n* A list of websites, books, forums, github repositories, and other resources (web or otherwise) that you referred to or used in this submission. This can be attached to the bottom of your answers document or placed in a separate plaintext file.\n* (Optional) Any code or other documents that you used to compute statistics for completing the project tasks.\n\nWith these materials, go to your Udacity Home page, click on this project, and follow the instructions to submit:\n\n* If you want to submit your files through a \"Link to Project\", upload your project files onto Github and send us the link.\n* If you instead want to submit your files through \"Upload a Zip\", compress your project directory, and submit that zip file.\n\nIt can take us up to a week to grade the project so keep checking back for updates.\n\nIf you are having any problems submitting your project or wish to check on the status of your submission, please email us at dataanalyst-project@udacity.com.", "nomination_eligible": false}}