{"status": "completed", "result": "passed", "grader_agent": "human", "id": 550617, "user_id": 124392, "notes": null, "repo_url": null, "created_at": "2017-06-14T04:06:28.787Z", "updated_at": "2017-06-14T05:35:48.843Z", "commit_sha": null, "grader_id": 115291, "assigned_at": "2017-06-14T05:33:32.202Z", "price": "18.0", "completed_at": "2017-06-14T05:35:48.834Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/550617/submission_content.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/550617/submission_content.zip"}, "udacity_key": null, "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": ["https://udacity-reviews-uploads.s3.amazonaws.com/_ann/550617/1497418543/Kami_Export_-_Project_5_Part_2__1_.pdf"], "general_comment": "", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 687, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 269, "user": {"name": "Jesselynn", "udacity_key": "10517016947"}, "grader": {"name": "Ayush", "udacity_key": "10495236499"}, "project": {"id": 269, "name": "Run an AdWords Campaign"}, "rubric": {"description": "Submission Type:  CSV and PDF files (two)\nReview Time Estimate: 30 minutes\nDescription: Run, Optimize, and Evaluate a Search Engine Marketing Campaign \n\n[P5 Part 2: Reviewer Guide](https://docs.google.com/presentation/d/1NXlpZoI6ZPOJQ12P026GdtXlyR_S-FjjzJBCi-eXIjQ/edit?usp=sharing).\n-----------\n## Run an AdWords Campaign  \n\nMake a copy of this [Google slide template](https://docs.google.com/presentation/d/1Gfr4OKaf72sT9nox6hil_1osckXkcxBHjalC80rPd5I/edit?usp=sharing) and complete each section. When you are ready, save your file as a PDF and submit it here.\n\n\nThe submissions slide template includes four sections: \n1. Campaign Approach\n2. Ad Groups\n3. Campaign Evaluation\n4. Appendix\n\nFor the first two sections we ask you to **paste the slides of your submission for the first part of the project**, so your reviewer has the necessary background to evaluate the second part of the project. The third section contains your actual submission for this project, which we’ll discuss in a moment. In the final section we want you to add three screenshots of the dashboard view of your Ad Groups, your ads, and the three most successful keywords. You will find example screenshots in the template.\n\n### Part 1: Campaign Approach\nLet’s have a closer look at the Campaign Evaluation part of this project: On the first three slides we ask you to present the key results of your campaign. To do that, we have prepared three tables that we want you to complete with the respective data from the AdWords dashboard. \n\n### Part 2: Ad Groups\nFirst, you present the results of your Ad Groups, then, the results of your ads, and finally, the data for the three keywords that you you consider most successful based on your marketing objective.\n \n### Part 3: Campaign Evaluation\nOnce you have completed the presentation of your campaign results, we ask you to evaluate your campaign performance. Here, you want to refer to your campaign objective and explain whether you think the campaign created a positive return on investment (ROI). \n\nFeel free to use bullet points for your evaluation and structure it in any way that works for you. You can use as many slides as you want for your evaluation. We have prepared a few questions that you can use to guide your evaluation, but there is no need to stick strictly to these questions:\n\n* Did your campaign result in a positive ROI?\n* Was the conversion rate higher or lower than expected?\n* How much did you have to spend per click? How close did you get to your max. CPC bid?\n* Which ad group, ads and keywords led to the highest click through and conversion rates and why might that have been the case?\n* Looking at the cost per click and the average position of your ad groups, can you infer which kind of keywords are subject to higher competition in AdWords?\n* Which keywords performed best for you and why might that have been the case?\n\nThese questions follow the same structure Lesson 6 was based on, so it might be a good idea to go back to the lesson if you need a refresher.\n\n### Part 4: Recommendations for future campaigns\nOnce you have completed your campaign evaluation, we ask you to outline what you would do if you had additional campaign budget. Again, feel free to use bullet points for your evaluation and structure it in any way that works for you. You can use as many slides as you want for your evaluation. We have prepared a few questions that you can use to structure your recommendations, but this serves only as a guide:\n\n* Would you focus on certain Ad Groups, ads or keywords?\n* Would you change any of your existing ads or keywords or add any new ones?\n* Would you set up an A/B test, and if so, how would you go about it?\n* Would you make changes to the landing page, and if so, what kind of changes and why?\n\n\n### Submission\nOnce you have completed all the slides, including the final section that contains your screenshot, be sure to convert your slides into a PDF and submit it below. \n\nIt's straightforward to convert a PowerPoint presentation into a pdf on a PC or Mac. If you used a Google Slides, simply click on File >> Download as...>> and choose pdf.\n\n\n###  Rubric\nYou can reference this project's [rubric](https://review.udacity.com/#!/rubrics/687/view) to review what your submission should include.\n\n\n", "nomination_eligible": false}}