{"status": "completed", "result": "failed", "grader_agent": "human", "id": 554088, "user_id": 73901, "notes": null, "repo_url": "https://github.com/joshtice/Titanic_project", "created_at": "2017-06-16T02:22:45.966Z", "updated_at": "2017-06-16T16:57:02.575Z", "commit_sha": "a2e7f3fe77a78ce32c5c001c5d1f00fa22b473de", "grader_id": 27461, "assigned_at": "2017-06-16T14:38:02.750Z", "price": "48.0", "completed_at": "2017-06-16T16:57:02.573Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/554088/archive.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/554088/archive.zip"}, "udacity_key": "4580521354067968", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "Congratulations for an excellent first submission! I added some comments and suggestions below in order not only to get your project to meet specifications, but also to make it a valuable addition to your data analyst portfolio. :) Keep up the good work!", "hidden": false, "previous_submission_id": null, "nomination": "", "language": "en-us", "rubric_id": 107, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 107, "user": {"name": "Joshua", "udacity_key": "6785915045"}, "grader": {"name": "Lucas", "udacity_key": "4601838662"}, "project": {"id": 107, "name": "Investigate a Dataset"}, "rubric": {"description": "Please have a look at [reviewer instructions here](https://docs.google.com/document/d/1pct7Q6cfSvRIfta1s8PuIN7kz5IaYuMZfPeCIwGsRkk/pub?embedded=True). Students have access to a notebook template to build their project around; this can be downloaded [here](https://d17h27t6h515a5.cloudfront.net/topher/2017/October/59dd0f5a_investigate-a-dataset-template/investigate-a-dataset-template.ipynb). Eligible datasets for students to use:\n\n* [Newer Datasets](https://docs.google.com/document/d/e/2PACX-1vTlVmknRRnfy_4eTrjw5hYGaiQim5ctr9naaRd4V9du2B5bxpd8FEH3KtDgp8qVekw7Cj1GLk1IXdZi/pub) - This document provides information about datasets available to students from October 2017 onwards. You may still see submissions using the following two datasets, however:\n* [Titanic Data](https://d17h27t6h515a5.cloudfront.net/topher/2016/September/57e9a84c_titanic-data/titanic-data.csv) - Contains demographics and passenger information from 891 of the 2224 passengers and crew on board the Titanic. You can view a description of this dataset on [the Kaggle website](https://www.kaggle.com/c/titanic/data), where the data was obtained.\n* [Baseball Data](http://www.seanlahman.com/baseball-archive/statistics/) - A data set containing complete batting and pitching statistics from 1871 to 2014, plus fielding statistics, standings, team stats, managerial records, post-season data, and more. This dataset contains many files, but you can choose to analyze only the one(s) you are most interested in.\n\nStudent submission instructions follow below.\n\n-----\n\nChoose one of Udacity's curated datasets and investigate it using NumPy and Pandas. Go through the entire data analysis process, starting by posing a question and finishing by sharing your findings.\n\n## Evaluation\n\nUse the [**Project Rubric**](https://review.udacity.com/#!/projects/3176718735/rubric) to review your project. If you are happy with your submission, then you are ready to submit! If you see room for improvement in **any** category in which you do not meet specifications, keep working! \n\nYour project will be evaluated by a Udacity reviewer according to the same [**Project Rubric**](https://review.udacity.com/#!/projects/3176718735/rubric). Your project must \"meet specifications\" or \"exceed specifications\" in each category in order for your submission to pass.\n\n## Submission\n\n### What to include in your submission###\n\n1. A PDF or HTML file containing your analysis. This file should include:\n    * A note specifying which dataset you analyzed\n    * A statement of the question(s) you posed\n    * A description of what you did to investigate those questions\n    * Documentation of any data wrangling you did\n    * Summary statistics and plots communicating your final results\n2. Code you used to perform your analysis. If you used an Jupyter notebook, you can submit your `.ipynb`. Otherwise, you should submit the code separately in `.py` file(s).\n3. A list of Web sites, books, forums, blog posts, github repositories, etc. that you referred to or used in creating your submission (add N/A if you did not use any such resources).\n\n### Jupyter notebook instructions\n\nIf you used Jupyter notebook to create your analysis, you can include your code directly in the notebook and do not need to create additional files to submit it separately. You will still need to export your work in a standalone format (see point 1 above). To download your notebook as an HTML file, click on File -> Download.As -> HTML (.html) within the notebook. If you get an error about \"No module name\", then open a terminal and try installing the missing module using `pip install <module_name>` (don't include the \"<\" or \">\" or any words following a period in the module name).\n\n### Ready to submit your project?###\n\nClick on the \"Submit Project\" button and follow the instructions to submit!\n\nIt can take us up to a week to grade the project, but in most cases it is much faster. You will get an email when your submission has been reviewed.\n\nIf you are having any problems submitting your project or wish to check on the status of your submission, please email us at dataanalyst-project@udacity.com.\n\n## What's Next?\nNow that you can say you've used Python libraries on a real project, make sure to add \"NumPy, Pandas, and Matplotlib\" to your resume. \n\nDon't have a resume? Choose a resume template from [the Muse](https://www.themuse.com/advice/the-41-best-resume-templates-ever) and start filling it out. It doesn't have to be polished - getting started and having an outline will help you later on with Udacity's resume review. After your next project, Wrangle OpenStreetMapData, we recommend optimizing your resume for an employer by completing the Resume Review in the Career: Job Search Strategies. Get a head start now!", "nomination_eligible": true}}