{"status": "completed", "result": "passed", "grader_agent": "human", "id": 573654, "user_id": 136492, "notes": "Right now all the links take you to my GitHub homepage because I have not made the repositories for these projects public yet but I will update that in the future when I do.", "repo_url": "https://github.com/andrew-hart/portfolio_website", "created_at": "2017-06-27T01:36:12.240Z", "updated_at": "2017-06-27T08:38:24.297Z", "commit_sha": "e4d46cf1791009a9098b6105074018e425d4891e", "grader_id": 641, "assigned_at": "2017-06-27T01:43:07.636Z", "price": "12.0", "completed_at": "2017-06-27T08:38:24.291Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/573654/archive.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/573654/archive.zip"}, "udacity_key": "5375333456019456", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": null, "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 45, "is_training": false, "canary_metadata": null, "checkmate_metadata": {"checkmate_token": "5acddb45-cea5-45dc-ab25-6023b0742869"}, "escalated_at": null, "ungradeable_tag": null, "project_id": 45, "user": {"name": "Andrew", "udacity_key": "8350199623"}, "grader": {"name": "Mani", "udacity_key": "115470134"}, "project": {"id": 45, "name": "Build a Portfolio Site"}, "rubric": {"description": "You will be provided with a design mockup as a PDF-file and must replicate that design in HTML and CSS. You will develop a responsive website that will display images, descriptions and links to each of the portfolio projects you will complete throughout the course of your Nanodegree program.\r\n\r\nThe design mockup is located [here](https://storage.googleapis.com/supplemental_media/udacityu/2655898586/design-mockup-portfolio.pdf).\r\n\r\n## Evaluation\r\nYour project will be evaluated by a Udacity Code Reviewer according to the **[Build a Portfolio Project Rubric](https://review.udacity.com/#!/rubrics/45/view)**. Be sure to review it thoroughly before you submit. All criteria must \"meet specifications\" in order to pass. \r\n\r\nSubmit [here](https://review.udacity.com/#!/projects/45/start).\r\n\r\nPlease note the HTML and CSS style guidelines below - following these is necessary to make sure your code passes the Code Quality rubric point.\r\n\r\n\r\n## Style Guidelines\r\n### CSS Guidelines\r\n - CSS - Use consistent indentation (tabs or spaces).   (See: CSS General Formatting Rules-Indentation)\r\n - CSS - Selectors, properties and property values (with the exception of strings) should be lowercase, including letters in hexadecimal color values. For example #f06c13 instead of #F06C13 and #ccc rather than #CCC. (See: CSS-General Formatting Rules-Capitalization.)\r\n - CSS - Use IDs and class names that are meaningful or generic. (See: CSS-ID and Class Naming.)\r\n - CSS - Use ID and class names that are as short as possible but as long as necessary. (See: CSS-ID and Class Naming.)\r\n - CSS - Use Shorthand properties in all possible places for margin, border, padding, background. Examples: https://developer.mozilla.org/en-US/docs/Web/CSS/Shorthand_properties. (See: CSS Style Rules-Shorthand Properties.)\r\n - CSS - Indent block content between curly braces. (See: CSS Formatting Rules-Block Content Indentation.)\r\n - CSS - End all declarations with a semicolon. (See: CSS Formatting Rules-Declaration Stops.)\r\n - CSS - Add single spaces after each property name’s  colon (See: CSS Formatting Rules-Property Name Stops.)\r\n - CSS - Remove trailing white spaces from code. (See: CSS General Formatting Rules-Trailing Whitespace)\r\n - CSS - Include a single space before the opening curly brace. (See: CSS-Declaration Block Separation.)\r\n - CSS - ID and class names should not be used with type selectors. (See Style Guide: CSS Style Rules-Type Selectors.)\r\n - CSS - Separate style rules with a blank line. (See: CSS-Rule Separations.)\r\n - CSS - Remove units of measure after 0 values. (See: CSS Style Rules-0 and Units.)\r\n - CSS - Use leading zeros for values in the code. (See: CSS Style Rules-Leading 0s.)\r\n - CSS - Use 3 character hexadecimal notation for color in all possible places.  For example #ccc rather than #cccccc. (See: CSS Style Rules-Hexadecimal Notation.)\r\n - CSS - Separate words in ID and class names with a hyphen. (See: CSS Style Rules-ID and Class Name Delimiters.)\r\n - CSS - Remove CSS hacks or user detection from code. \r\n(See: CSS Style Rules-Hacks.)\r\n - CSS - Separate selectors and declarations with new lines. \r\n(See: CSS-Selector and Declaration Separation.)\r\n - CSS - Use double quotes for all attribute selectors and property values. \r\n(See: CSS Formatting Rules-CSS Quotation Marks.)\r\n - CSS - Identify groups of related style rules with section comments. \r\n(See: CSS Meta Rules-Section Comments.)\r\n\r\n### HTML Guidelines\r\n - HTML - Element and attribute names should all be lowercase. (See: Capitalization.)\r\n - HTML - Use HTML5. (See: HTML Style Rules-Document Type.)\r\n - HTML - Use UTF-8 as character encoding. \r\n(See: General Meta Rules-Encoding.)\r\n - HTML - Place all block/list/table elements on a separate line and indent child elements. (See: HTML-General Formatting.)\r\n - HTML - Use semantic tags. (See: HTML Style Rules-Semantics.)\r\n - HTML - Provide alternate content for multimedia. \r\n(See: HTML Style Rules-Multimedia Fallback.)\r\n - HTML - Remove trailing white spaces from code. \r\n(See: HTML - General Formatting Rules - Trailing Whitespace.)\r\n - HTML - Use consistent indentation (tabs or spaces) \r\n(See HTML - General Formatting Rules - Indentation)\r\n - HTML - Use comments to explain the code. \r\n(See: General Meta Rules-Comments.)\r\n - HTML - Mark action items with TODO. \r\n(See: General Meta Rules-Action Items.)\r\n - HTML - Remove entity references. \r\n(See: HTML Style Rules-Entity References.)\r\n - HTML - Remove type attribute from link and script elements. \r\n(See: HTML Style Rules-Type Attributes.)\r\n - HTML - Use double rather than single quotation marks for attribute values. \r\n(See: HTML-HTML Quotation Marks.)\r\n\r\n## Submission\r\n1. The master branch is the default Github repository branch. If you wish to submit another branch, you'll need to set it as the [new default branch](https://help.github.com/articles/setting-the-default-branch/) inside your Github repository.\r\n2. When you're ready to submit your project go back to your <a href=\"https://www.udacity.com/me\" target=\"_blank\">Udacity Home</a>, click on Project 1, and we'll walk you through the rest of the submission process. Due to the high volume of submissions we receive, please allow up up to **7 business days** for your evaluation to be returned.\r\n3. If you are having any problems submitting your project or wish to check on the status of your submission, please email us at **fullstack-project@udacity.com** or visit us in the <a href=\"http://discussions.udacity.com\" target=\"_blank\">discussion forums</a>.\r\n\r\n## What's Next?\r\nYou will get an email as soon as your reviewer has feedback for you. In the meantime, review your next project and feel free to get started on it or the courses supporting it!", "nomination_eligible": false}}