{"status": "completed", "result": "passed", "grader_agent": "human", "id": 573948, "user_id": 127711, "notes": "Since the only problem for my project was the length of the blog, I wrote more stories for the blog.\r\nThank you.", "repo_url": null, "created_at": "2017-06-27T04:44:42.489Z", "updated_at": "2017-06-27T08:27:51.013Z", "commit_sha": null, "grader_id": 43084, "assigned_at": "2017-06-27T04:55:19.349Z", "price": "12.0", "completed_at": "2017-06-27T08:27:51.000Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/573948/submission_content.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/573948/submission_content.zip"}, "udacity_key": null, "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": ["https://udacity-reviews-uploads.s3.amazonaws.com/_ann/573948/1498552007/573948_P2Submission_MinguYeo.pdf"], "general_comment": "Great work with the submission!\nPlease find the annotated file, there are a few suggestion to improve your submission even further.", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 659, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 264, "user": {"name": "Mingu", "udacity_key": "10551848608"}, "grader": {"name": "Shubham", "udacity_key": "u1621051"}, "project": {"id": 264, "name": "Market your Content"}, "rubric": {"description": "Related Course: Content Strategy and Social Media Marketing\nSubmission Type:  PDF\nReview Time Estimate: 20 minutes\nDescription: In this project we want you to practice producing and marketing content about a subject you know very well – yourself! First, you are going to write a blog post (minimum of 250 words and maximum of 500). Next, you’ll craft social media post for three social platforms to share your blog post with your audience. \n\n[DMND Reviewers Handbook](https://docs.google.com/document/d/1gILVtaotovaqd1hc8b7fBwnBQNdKJlbq-agyvbOicI8/edit?usp=sharing)\n\n---- \n**Make a copy of this [Google doc template](https://docs.google.com/presentation/d/1zm1S95IiUQ2cYddwUpsypEGQxrtwC_OF7M4fB3Ouw1s/edit?usp=sharing)** or download the PPT template from the resource section of this project. Make sure to complete each section. When you are ready, save your file as a PDF and submit it.\n\n\n<center><a href=\"https://docs.google.com/document/d/1QG00LiBAhuOAtz5rfZ0J1dqWu6nQ-rPm_vBl3nifRd4/edit?usp=sharing\" target=\"_blank\"><button style=\"box-sizing: border-box; border-radius: 4px; background: #02B3E4; border: none; height: 44px; padding: 0 25px; color: white; cursor: pointer; font-family: Open Sans,sans-serif; display: inline-block; border: none; font-size: 12px; letter-spacing: 1px; font-weight: 600; text-transform: uppercase;\">Go to Project Template</button></a></center>\n\n\n## Part 1: Getting Started\n*Below is an outline of what is required for this project. Please provide your answers in the project template.*\n\nBefore you start crafting your blog post, you’ll want to think about the target persona that the post will be written for, the marketing objective for your blog post, and the KPI.  \n\n1. Provide the marketing objective for your blog post\n2. Provide a KPI for your blog post\n3. Copy and paste your Target Person from Project One and make any updates or changes based on your learnings from the previous project. \n\n## Part 2: Write a Blog Post\n\n\n1. Select a theme for your blog post: \n\n      * Why have you decided to take the Digital Marketing Nanodegree Program?\n      * Choose a successful or creative marketing campaign that you love. What is the story being told by the campaign and why do you love it, why did it catch your attention?\n\n2. Select the framework you’ll be using to craft the content for your blog post:\n      * SCQA, also called the Pyramid Principle *or*\n      * Pixar framework\n\n3. Write a blog post, with the theme you’ve chosen from the options above, in the space provided below. \n      * Remember to keep in mind your target audience when crafting your post. \nConsider: What voice and tone are appropriate?\n      * If you include media in your post, include it and make sure you are compliant with copyright laws.\n      * Your post should be a *minimum of 250 words and maximum of 500.*\n\n## Part 2: Craft Social Media Posts \n1. List three social media platforms your target audience is likely to visit. Include, a short one or two sentences description of why you chose these channels.\n\n2. Craft a post for each of the platforms promoting your blog. \n     \n** Optional Extra Credit:** While you don’t actually have to share your posts online to pass this project (you will submit it in a template), you are more then welcome to do so. Publish your posts on the platforms you have chosen and submit screenshots for review in the submission template. Where applicable include the hashtag #IminDMND, we'll select the best posts and share them on our social channels and share your results. \n\n\n-------\n\n### Rubric\nYou can reference this project's [rubric](https://review.udacity.com/#!/projects/264/view) to review what your submission should include.  \n-------\n# Concepts:\n\n## Storytelling Frameworks\n\nThere are a number of different story structures you can use to build a personal connection and drive action. Here are two you should consider.\n\nSCQA, also called the Pyramid Principle and the Pixar framework\n\n**SCQA**: One framework you can use to create an engaging story is called SCQA which stands for situation, complication, question, and answer.\n\nThe situation is a clear, crisp statement of the facts. It's the state of affairs as they are right now. \nComplication is the thing that's changed that makes things harder; the change in circumstances that you should be concerned about.\nQuestion normally falls out of the situation and complication. Like, what should we do?\nAnd Answer is the answer to this question - it usually resolves the complication.\n\n**SCQA Example:**\nHere’s how SCQA would apply to the story of Little Red Riding Hood. \nSituation:  Little red riding hood walks through the woods to deliver food to her grandmother\nComplication: A wolf pretends to be her grandmother so that he can eat Little Red Riding Hood\nQuestion: How will she escape?\nAnswer: A lumberjack comes to the rescue\n\n**Pixar**: The Pixar framework is from Pixar, a famous storytelling company responsible for some of the most popular animated movies of all time like Toy Story. Pixar’s stories follow this simple outline.\n\nOnce there was a - usually a protagonist with a goal\nEveryday - describes the protagonist’s routine\nUntil one day  - something pivotal that changes everything\nBecause of that- what follows as a result\nBecause of that\nUntil then - the protagonist reaches goal, but often not in the way they  originally thought they would \nEver since then - how the character and their situation has changed.\n\n**Pixar Example**\nHere’s how the Pixar framework would apply to Star Wars.\n\nOnce there was a farm boy who wanted to be a fighter pilot\nEveryday he helped out on the farm\nUntil one day his family is killed\nBecause of that he joins Obi-wan kenobi\nBecause of that there were lots of wars in stars.\nUntil finally he becomes a star fighter pilot and saves the day\nEver since then he’s known not only as a pilot but also a Jedi\n\n\n**Social Media Landscape and categories:**\n\nMuch of the social media landscape falls into 6 main categories: Publishing, Sharing, Messaging, Discussing, Collaborating, and Networking. These categories describe how the respective social media channels are primarily used. It’s important to keep that in mind as well when you choose your channel and create content to fit that channel.\nWhat about the most popular social media sites?  Many of these channels serve multiple purposes. \n\nFor example, Facebook, Twitter, and LinkedIn allow for Publishing, Sharing, Messaging, Discussing, Collaborating, AND Networking.\nWhereas Pinterest and Instagram are more visual. But as they are mainly about photos, they are more static.\n\nYouTube is also visual but video is more dynamic.\n\nSnapchat takes visuals and the dynamics of video further by incorporating messaging. ", "nomination_eligible": true}}