{"status": "completed", "result": "failed", "grader_agent": "human", "id": 579777, "user_id": 146748, "notes": "I am just starting with the course. I hope i still have enough time to catch up", "repo_url": null, "created_at": "2017-06-30T08:15:40.386Z", "updated_at": "2017-06-30T10:16:09.715Z", "commit_sha": null, "grader_id": 49600, "assigned_at": "2017-06-30T09:09:35.362Z", "price": "9.0", "completed_at": "2017-06-30T10:16:09.703Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/579777/submission_content.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/579777/submission_content.zip"}, "udacity_key": null, "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": ["https://udacity-reviews-uploads.s3.amazonaws.com/_ann/579777/1498817398/review-579777.pdf"], "general_comment": "This has been a great submission, so please don't be discouraged by some sections being marked as requires changes. Each section has multiple points that are evaluated; unfortunately not meeting a single point will cause the whole section to be marked thus. You have made some good progress, and with just a little tweaking, you should be good to go.\n\nPlease have a look at my notes and suggestions in-line over your submission in the annotations section, or in the link below.\n[review-579777.pdf](https://udacity-reviews-uploads.s3.amazonaws.com/_attachments/49600/1498817394/review-579777.pdf)\n**--**\n\n**You Wrote:** *I am just starting with the course. I hope i still have enough time to catch up*\n**Response:** Don't worry about it. I would suggest that you get in touch with your assigned classroom mentor as soon as possible to decide on an action plan on how you should proceed to meet all requirements for graduation. This also depends on the date you joined the course. Even if you joined the first cohort (March 22), there is still around 2. 5 months remaining (though the term has already ended is currently a week into the term extension), which should be enough to complete all projects if you set your mind to it. All the best. You can submit all projects while in the term extension.", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 657, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 263, "user": {"name": "Clemence", "udacity_key": "10614739329"}, "grader": {"name": "DOMINIC PERCIVAL", "udacity_key": "6861067963"}, "project": {"id": 263, "name": "Prepare to Market"}, "rubric": {"description": "Related Course: Power of Digital Marketing\nSubmission Type:  PDF\nReview Time Estimate: 15 minutes\n\nDescription: Articulate business model, marketing objective, and primary KPI; write a value proposition, and develop a customer persona.\n------------------------------------\n## Here are the students instructions for reference: \nFor your projects in the Digital Marketing program, you can pick one of two marketing challenges – one focussing on a B2C product, one focussing on a B2B product.\n\n### Marketing Challenge #1: Digital Marketing Nanodegree Program\n\nYou are tasked with attracting future fellow students for this Digital Marketing Nanodegree Program. More specifically, your objective is to collect email addresses of potential students, who could be interested in taking this course. In order to do this, we have created a [landing page](http://dmnd.udacity.com/ebook), where prospective students can download a free eBook if they provide us with their email address. The eBook – a Social Advertising Guide – is a short excerpt from the Digital Marketing Nanodegree Program, content that you will see in the Social Advertising course.\n\nFor the purpose of the projects, assume costs of $0 for the eBook and a conversion value (revenue) of $10 per collected email address.\n\n### Marketing Challenge #2: Udacity Enterprise\n\nYour task is to generate new business for Enterprise’s DMND Corporate Training, in order to equip a company’s team into with the latest skills in digital marketing. More specifically, your objective is to generate leads, i.e., collect contact information of companies that could be interested in the services offered by Udacity Enterprise. In order to do this, we have created a landing page, where prospective client companies can learn more about Enterprise’s offerings for the Digital Marketing Nanodegree program. From this page, clients can then request more information through a contact form after filling out required fields about their company that provides crucial information to the Udacity Enterprise team. \n\nFor the purpose of the project, assume a cost of $0 since potential customers provide their email addresses for free, and a conversion value (revenue) of $150 per collected lead.\n\nWhen choosing your marketing challenge, think about the kind of products and brands you want to work for in the future. You will stick with the same product throughout the whole Nanodegree program.\n\n------------------------------------\n### Project Template\n# Project 1: Get Ready to Market\n\n**Make a copy of this [Google doc template](https://docs.google.com/presentation/d/1vZ-gGYod0Qklq8Rqo1KASykAn0-PUphVeBn0D472RTc/edit?usp=sharing)** or download the PPT template from the resource section of this project. Make sure to complete each section. When you are ready, save your file as a PDF and submit it.\n\n### Step 1: Getting Started\n\nImagine that Udacity has tasked you with creating a campaign for either the DMND Program or Enterprise. To get started you will first need to decide which product you will be marketing. \n\nNext you will need to articulate the marketing objective and KPI for your pretend campaign. Since you will not be creating an actual campaign you can make your marketing objective as lofty as you like, just remember to make your objective SMART. \n\n**SMART**objectives are:\n**S**pecific, **M**easurable, **A**chievable, **R**ealistic, and **T**imebound. \n\nYou will be providing your answers in the template for this project to help you get comfortable using slides for presentations. It is a great opportunity for you to get familiar with this now, as you will be using this tool further on in the course. \n\n\n### Step 2: Value Proposition\n\nNow that you’ve chosen a marketing challenge, you need to articulate the value proposition for the product you’ve chosen. This will help to ensure that you and your pretend client, Udacity, are aligned on potential customers, product/service value, along with the competitive landscape and differentiator. For this section you will be using Geoffrey Moore’s template as a guide to create your value proposition. \n\n\n### Step 3: Customer Persona\n\nThroughout the course you will be using the customer persona you are creating now to keep you focused on who your customer is while you are writing content, building campaigns, and auditing sites. \n\n**Create an Empathy Map**\nTo create your customer persona you will first need to interview potential customers and  create an empathy map. As you’ve learned in this course, an empathy map is used to understand and summarize customer research. Most empathy maps have four quadrants broken into Thinking, Seeing, Doing, and Feeling.  \n\n**Interview Potential Customers**\nYou will be interviewing a minimum of three potential customers to collect information for your empathy map. After you interview your potential customers, you’ll prepare all of the information you gathered onto sticky notes and place them in one of the four quadrants:\nThinking, Seeing, Doing, and Feeling.\n\n* [List of potential questions](https://docs.google.com/document/d/1kuNO4o8fCw--LMAuHIxEa19lUtSSQaYg1edMroJUzWU/edit?usp=sharing)\n\n* As much as possible, list the actual words and phrases your customers say, the applications they use, and the websites they visit. \n\n* Once you have your empathy maps, you’re ready to create a persona.\n\n**Construct Customer Persona** \n\nThe customer persona is a fictional character that summarizes and communicates the key characteristics of your target customer.  When creating the persona, you will use the information from the empathy maps to inform what characteristics your fictional person will have. \n\nTo describe your persona, you will use the template provided in the deck.  First describe the background and demographics, next the hobbies, then the needs and barriers they face, and finally, lay out the goals of your persona. It is a good idea to give your persona a descriptive name and add a picture of what he or she may look like.  \n### Submission\nFinally, be sure to convert your answers document into a PDF and submit it below. It's straightforward to convert a Microsoft Word document into a pdf on a [PC](https://support.office.com/en-gb/article/Save-or-convert-to-PDF-d85416c5-7d77-4fd6-a216-6f4bf7c7c110) or [Mac](https://support.office.com/en-us/article/Save-or-convert-to-PDF-on-your-Mac-aa183751-1f09-4b8b-88a4-099a0c7528da). If you used a Google Doc, in Google Docs, simply click on File >> Download as...>> and choose pdf.\n\n### Rubric\nYou can reference this project's [rubric](https://review.udacity.com/#!/projects/263/view) to review what your submission should include.  \n\n------------------------------------\n\n## Concepts and additional resources \n\n### Business Components\nThe key business components \n* The **revenue sources** - How do you make money? What price do you charge? \n* The **costs** - What does it cost you to produce or offer your product or service?\n* The **product or service** - What is it? How does it benefit customers?\n* The **customers** - Who are they? Are they consumers or businesses or both? Do they interact with you online, offline, or both? \n\n### Business Models \nBusiness models can be complex, but at their core, it really defines how a business creates value. Business to consumer or B2C companies sell products or service to consumers. Betabrand is an e-commerce company. They sell clothes to men and women through a website. They are considered a business to consumer or B2C company.\n\n\nBusiness to business or B2B companies sell to other businesses. The sales are typically of large products or services. BambooHR sells HR software to small to medium-sized companies. They are considered a business to business or B2B company.\n\n**Note** - The key business components are a guideline, and if one aspect it missing, but it is clear that the student understands the concept of a business model, they have met expectations. \n\n\n### Marketing Objective\n \n**SMART Objectives**\n\n* **S**PECIFIC\n* **M**EASURABLE\n* **A**CHIEVABLE\n* **R**ELEVANT\n* **T**IME PHASED\n\nA **marketing objective** is simply what you want to achieve with your marketing efforts. You can have one or several marketing objectives. Examples of marketing objectives are: build a brand, generate leads, drive or increase sales, convert leads into sales, increase customer loyalty\n\n### KPI\n\n**Key** - Important \n**Performance** - How You're Doing\n**Indicator** - Often a Metric or a Value\n\nKPI -  a Key Performance Indicator A KPI is a way (an indicator) to tell how you’re performing against an objective - something that is important to you. Marketing KPIs are what tie your marketing activities to your marketing objectives. Many marketers often interchange the term KPI with the term metric. In this course we’ll use the concept of a primary KPI - the most central activity you’re measuring - as separate from the metrics that might support it. Here are a few marketing KPIs: marketing return on investment or ROI, number of incremental sales, number of leads, Net promoter score, email engagement score\n\n### Value Proposition\n\nA value proposition conveys:\n* what you’re selling\n* what the benefit is in using it\n* who the target customer is for your product or service\n* what makes your offering different from competitors - what makes you unique\n\nMarketing guru Geoffrey Moore popularized Value Propositions in his book, Crossing the Chasm. This is his template for a value proposition.  It is a very simple template that can help you crystallize your company’s value proposition. \n\nGeoffrey Moore’s template: **For** (target customer) ** who** (statement of the need or opportunity) **our** (product/service) is (product category) **that** (statement of benefit). **Unlike** (closest competitor), **our offer** (primary differentiation).\n\n#### Examples: \nOf course, everyone expresses value propositions a little differently, but at their core, they should be hitting on all 6 of the components above.\n\nBetabrand’s value proposition might read:\n**FOR** trend conscious customers\n**WHO** need clothes that fit their busy lifestyle\n**OUR** online clothing store\n**THAT** offers crowd sourced apparel\n**UNLIKE** sites like Teespring\n**OUR OFFER** includes all kinds of innovative clothing designed by our community from scratch\n\nEzequiel Farca’s value proposition might read:\n**FOR** design minded customer\n**WHO** need a home custom designed to their needs and taste\n**OUR** architecture and design services\n**THAT** offer high end modern design\n**UNLIKE** architecture firms like WRNS Studio\n**OUR OFFER** balances harmonious modern architecture, with our own award winning interior design & furniture\n\nIf you need more inspiration, see more on value propositions on [HubSpot](http://blog.hubspot.com/marketing/write-value-proposition#sm.00000vzhym4ojre13rlj7cs9ot3fn). \n\n### Customer Persona\n\n### Empathy Map\nTo understand users, designers created empathy maps to summarize customer research.  And today most digital marketers use them to understand their customers. Most empathy maps have four quadrants broken into “Thinking,” “Seeing,” “Doing,” and “Feeling.” To start building your empathy map, you have to get to know your customers by using a combination of interviews, visiting customers in their environments, and data you have from other research. \n\nYou collect all the information you generate, put it on stickies, and then place them in each quadrant. Then, put yourself in the shoes of the customers you talked to and summarize your findings. What do they think and feel? What do they hear? What do they see? What do they say and do? \n\nAs much as possible, list the actual words and phrases your customers use, the applications they use, the websites they visit. And so on. What you collect here will be extremely useful to you as you build out your marketing messages and select your marketing channels.\n\nOnce you have your empathy maps, you’re ready to create a persona. A persona is a fictional character that summarizes and communicates the key characteristics of your target customer.  When creating the persona, you use the information from the empathy maps to inform what your fictional person looks like. \n\n### Customer Persona\nCreating this persona is helpful as it keeps you focused on who your customer really is.  It can also help to get all people in the company on the same page when they think about the customer. \n\nTo describe your persona, this template is helpful.  You first describe the background and demographics, then hobbies, then lay out the goals of your persona. You also describe the needs and barriers they face.  It is a good idea to give your persona a descriptive name and add a picture of what he or she may look like.  This helps to form a better image of who your persona is. \n\nHubSpot has more examples of personas [here](https://blog.hubspot.com/marketing/buyer-persona-examples#sm.0001l6650q2kfedtyih24xsgjv28t).", "nomination_eligible": false}}