{"status": "completed", "result": "failed", "grader_agent": "human", "id": 593525, "user_id": 48843, "notes": null, "repo_url": null, "created_at": "2017-07-07T17:12:20.189Z", "updated_at": "2017-07-07T19:30:14.819Z", "commit_sha": null, "grader_id": 1254, "assigned_at": "2017-07-07T18:34:26.322Z", "price": "55.0", "completed_at": "2017-07-07T19:30:14.815Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/593525/Understanding_Investors_2.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/593525/Understanding_Investors_2.zip"}, "udacity_key": "6082661654331392", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "", "hidden": false, "previous_submission_id": null, "nomination": "", "language": "en-us", "rubric_id": 26, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 26, "user": {"name": "Jennifer", "udacity_key": "6868854624"}, "grader": {"name": "Shmuel", "udacity_key": "1633408571"}, "project": {"id": 26, "name": "Explore and Summarize Data"}, "rubric": {"description": "Please carefully read the [instructions found here](https://docs.google.com/document/d/1igUXeEOoyddfze1EFONqVlDH_o8dwXxPEWF0rTzFdQA/pub?embedded=true).\n\n###Student Instructions\nUse R and apply exploratory data analysis techniques to explore relationships in one variable to multiple variables and to explore a selected data set for distributions, outliers, and anomalies.\n\n## Evaluation\n\nUse the <a href=\"https://review.udacity.com/#!/projects/3165188753/rubric\" target=\"_blank\">**Project Rubric**</a> to review your project. If you are happy with your submission, then you are ready to submit! If you see room for improvement in **any** category in which you do not meet specifications, keep working!\n\nYour project will be evaluated by a Udacity reviewer according to the same <a href=\"https://review.udacity.com/#!/projects/3165188753/rubric\" target=\"_blank\">**Project Rubric**</a>. Your project must \"meet specifications\" or \"exceed specifications\" in each category in order for your submission to pass.\n\n### Common Problems with Project Submissions\n\nTo help you succeed, we recommend comparing your project submission against the following list of common problems. Your project must **avoid** these common problems in order to pass.\n\n* **Insufficient documentation of transformation steps.** Data processing or transformations (creating a categorical variable) should be performed programmatically and included in the RMD file and the final knitted HTML output. When you perform these operations, make sure you have text that documents the creation of these transformed variables.\n* **Insufficient comments following plots.** For every plot or related group of plots, make sure you follow them with a text chunk that describes what can be observed or understood. Your reader should be able to follow your thought processes through the alternating text and visualization sections.\n* **Final Plots section is not included.** Following your main exploration (univariate, bivariate, and multivariate plots and analysis), you need to select three visualizations to present in the final plots section. Make sure that these plots illustrate the most interesting findings or patterns from your investigation. The plots should now be polished with appropriate visualization types, titles, and axis labels with units. See the subsection below for notes on making plots for this part of the project report.\n* **Reflection section is not included or is not the last section in the RMD file.** Make sure you have a reflection section following your Final Plots section that summarizes your exploration and provides some thoughts for future analysis. This should be the last part of the document.\n\n### <a href=\"https://docs.google.com/document/d/1-f3wM3mJSkoWxDmPjsyRnWvNgM57YUPloucOIl07l4c/pub\" target=\"_blank\">Creating Effective Plots</a>\n\nThe **Final Plots** section in your RMD file should contain three polished plots that give insight into the data set that you investigated.\n\n**Each plot should also contain a caption or description about what the plot shows.**\n\nIn determining whether or not you have three strong plots, please consult the document, **<a href=\"https://docs.google.com/document/d/1-f3wM3mJSkoWxDmPjsyRnWvNgM57YUPloucOIl07l4c/pub\" target=\"_blank\">Creating Effective Plots</a>**. The document covers four common problems that project evaluators have encountered in the past and how those plots can be improved.\n\n## Submission\n\nReady to submit your project?  Make sure you have the following files:\n\n1. The RMD file containing the analysis (final plots and summary, and reflection)\n2. the HTML file knitted from the RMD file using the knitr package\n3. the original data set and source if you used your own data rather than one recommended by Udacity (Note: do not submit a data set if you used one that Udacity recommended)\n4. A list of  Web sites, books, forums, blog posts, github repositories, etc. that you referred to or used in creating your submission (add N/A if you did not use any such resources).\n\n## What's Next?\nFirst of all, have you added R to your list of skills yet? Be sure to add it to your resume, LinkedIn profile, and any other job or networking profiles.\n\nBy now, you've practiced pitching a project and have built an employer-friendly resume you can continue building. Now, it's time to take the next step and start pitching yourself as a data analyst.\n\nWhen networking, people would want to know:\n1. What is a project you've been working on recently, and what was the result?\n2. What do you want to do now and why?\n3. How does it relate to what they're doing?\n\nGet a preview of the Personal Branding lesson in the Career: Networking part by watching a [one-minute video](https://www.youtube.com/watch?v=0QtgTG49E9I) where Chris, a teacher-turned-full-stack-engineer at Udacity, pitches his career change.\n", "nomination_eligible": true}}