{"status": "completed", "result": "passed", "grader_agent": "human", "id": 595325, "user_id": 145007, "notes": null, "repo_url": null, "created_at": "2017-07-08T16:48:17.849Z", "updated_at": "2017-07-08T17:32:23.017Z", "commit_sha": null, "grader_id": 20494, "assigned_at": "2017-07-08T17:26:32.982Z", "price": "9.0", "completed_at": "2017-07-08T17:32:23.008Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/595325/submission_content.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/595325/submission_content.zip"}, "udacity_key": null, "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": ["https://udacity-reviews-uploads.s3.amazonaws.com/_ann/595325/1499535081/595325-review.pdf"], "general_comment": "This was an excellent effort!\nCongratulations on successfully completing this project! :tada:\n\nBe sure to check out the annotations file provided!\nKeep up the good work and all the best for your future projects!", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 382, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 219, "user": {"name": "Kartik", "udacity_key": "8686449378"}, "grader": {"name": "River", "udacity_key": "711368571"}, "project": {"id": 219, "name": "Data Cleanup"}, "rubric": {"description": "Students will load several datasets and will\n\n* Cleanup, format, and blend a wide range of data sources\n* Analyze outliers and decide which outliers to remove from the dataset\n\nThis project is part of the Predictive Analytics for Business Nanodegree program.\n\nAfter completing the project by filling out the submission template and reviewing it using the [project rubric](https://review.udacity.com/#!/rubrics/382/view), click the Submit Project button below and upload your submission.\n\nYou may also include your Alteryx workflow if you'd like. If your submission does not meet specifications, having the workflow may help the review identify mistakes.\n\n### The Business Problem\n\nPawdacity is a leading pet store chain in Wyoming with 13 stores throughout the state.  This year, Pawdacity would like to expand and open a 14th store. Your manager has asked you to perform an analysis to recommend the city for Pawdacity’s newest store, based on predicted yearly sales.\n\nYour first step in predicting yearly sales is to first format and blend together data from different datasets and deal with outliers.\n\nYour manager has given you the following information to work with:\n\n1. The monthly sales data for all of the Pawdacity stores for the year 2010.\n2. NAICS data on the most current sales of all competitor stores where total sales is equal to 12 months of sales.\n3. A partially parsed data file that can be used for population numbers.\n4. Demographic data (Households with individuals under 18, Land Area, Population Density, and Total Families) for each city and county in the state of Wyoming. For people who are unfamiliar with the US city system, a state contains counties and counties contains one or more cities.\n\n<center> **Map of Wyoming Counties**</center>", "nomination_eligible": false}}