{"status": "completed", "result": "passed", "grader_agent": "human", "id": 596518, "user_id": 147794, "notes": "This is my first submission for the 2nd project, I have my doubt about the performance of the network, especially because the accuracy only improves at a slow pace.", "repo_url": "https://github.com/SilvioGiancola/dlnd-Project2", "created_at": "2017-07-09T08:33:23.389Z", "updated_at": "2017-07-09T11:14:35.852Z", "commit_sha": "ac21cdd7bf293962ee433cafbca4414855823baa", "grader_id": 46226, "assigned_at": "2017-07-09T08:43:32.347Z", "price": "20.0", "completed_at": "2017-07-09T11:14:35.845Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/596518/archive.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/596518/archive.zip"}, "udacity_key": null, "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "## Awesome\nYou did really great! First submission and you did it. Congratulations!\nAbout the performance of the network it is good. If you reduce the number of layers and nodes it maybe able to converge faster but the final performance of the network should be reduced.\n## Suggestion\nHere there is a great blog post about Conv Nets: http://colah.github.io/posts/2014-07-Conv-Nets-Modular/\nGreat article about CNN: http://www.matthewzeiler.com/pubs/arxive2013/eccv2014.pdf\nI recommend checking the Google Python Style Guide, there are great tips about how to improve coding, in general: https://google.github.io/styleguide/pyguide.html", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 723, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 275, "user": {"name": "Silvio", "udacity_key": "u815035"}, "grader": {"name": "Ivan", "udacity_key": "8907400273"}, "project": {"id": 275, "name": "Object Classification"}, "rubric": {"description": "In this project, students will classify images from the CIFAR-10 dataset.  The dataset consists of airplanes, dogs, cats, and other objects.  They will preprocess the images, then train a convolutional neural network on all the samples.  The students will normalize the images and one-hot encode the labels.  They will build a convolution, max pool, fully connected, input, and output layers.  At then end, they will see their predictions on the sample images.\n\n# Image Classification\n### Introduction\nIn this project, you'll classify images from the [CIFAR-10 dataset](https://www.cs.toronto.edu/~kriz/cifar.html).  The dataset consists of airplanes, dogs, cats, and other objects.  The dataset will need to be preprocessed, then train a convolutional neural network on all the samples.  You'll normalize the images, one-hot encode the labels, build a convolutional layer, max pool layer, and fully connected layer.  At then end, you'll see their predictions on the sample images. \n\n### Getting the project files\nThe project files can be found in our [public GitHub repo](https://github.com/udacity/deep-learning), in the `image-classification` folder. You can download the files from there, but it's better to clone the repository to your computer\n\nThis way you can stay up to date with any changes we make by pulling the changes to your local repository with `git pull`. Please note this project is written in Python 3.x.\n\n### Submission\n1. Ensure you've passed all the unit tests in the notebook.\n2. Ensure you pass all points on [the rubric](https://review.udacity.com/#!/rubrics/723/view).\n3. When you're done with the project, please save the notebook as an HTML file. You can do this by going to the **File** menu in the notebook and choosing \"Download as\" > HTML. ** Ensure you submit both the Jupyter Notebook and it's HTML version together. **\n4. Package the \"dlnd_image_classification.ipynb\", \"helper.py\", \"problem_unittests.py\", and the HTML file into a zip archive, or push the files from your GitHub repo.\n5. Hit Submit Project below! ", "nomination_eligible": false}}