{"status": "completed", "result": "passed", "grader_agent": "human", "id": 662969, "user_id": 167820, "notes": null, "repo_url": null, "created_at": "2017-08-08T19:11:46.163Z", "updated_at": "2017-08-08T20:03:13.252Z", "commit_sha": null, "grader_id": 616, "assigned_at": "2017-08-08T19:22:15.473Z", "price": "6.0", "completed_at": "2017-08-08T20:03:13.246Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/662969/my-first-project.html.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/662969/my-first-project.html.zip"}, "udacity_key": "5628669593780224", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "### Excellent submission. Keep on keeping on. One step at a time!\n\nA quote I like to encourage myself with when facing difficult problems and sticking with it.\n\n*\"It's not that I'm so smart, it's just that I stay with problems longer.\"* - Albert Einstein.", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 47, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 47, "user": {"name": "Sojeong", "udacity_key": "10816475260"}, "grader": {"name": "Patrick_k_o", "udacity_key": "u5955917"}, "project": {"id": 47, "name": "Getting Started with HTML"}, "rubric": {"description": "# Getting Feedback\n\nThroughout your Nanodegree program, you will submit your work for review. When you submit a project, you will receive a grade that indicates either that you've passed that project or that you need to work on your project and submit again.  \n  \n## Important:\n* You will **not** receive a grade for your **Getting Started with HTML** submission, but you **will** receive personalized feedback.\n* We’d like you to complete this project within one week of beginning the Nanodegree, but <b>there will not be any consequence for missing this deadline</b>.  \n* Try to complete future projects on time.\n* This project serves as a <b>formative checkpoint</b> designed to give you immediate feedback and ensure you have the confidence and the support you need to keep moving forward.  \n\n## Project Details:\n* If you haven’t already created an HTML file to contain your notes from this section, refer back to the beginning of the lessons for setting up your file. \n* To complete this project, you’ll need to submit your notes as an HTML file using the tags you learned about in these lessons, such as `<p>,<div>, <h1>, <b>, <em>,` and `<span>`.\n* Keep it simple. CSS is used for styling and is not necessary for this project.\n* Make sure you use proper HTML Document structure for your code.\n\n## Submission Instructions:\nWhen you have your HTML file ready for submission, you can click on the **Submit Project** button below to upload it for review. \n\nOne thing to note when you click on this button is that you’ll see **three** different ways to submit your project. You can:\n* upload a zip file,\n* select a GitHub repository, or\n* upload a specific file type (`.zip`, `.html`).\n\nIn general, you’ll be choosing the first option — uploading a zip (or compressed) file — to submit your projects. If you’re unsure how to create a zip file, go through the instructions in the section below. \n\nFor this particular project, you only need to submit one file type (an HTML file), so you could technically use the third option to directly upload your file ending in an `.html` extension. This approach will work just fine for this project, but we’d encourage you to familiarize yourself with submitting projects as zip files, especially because you’ll be doing so for future projects in this program.\n\n\n## Submitting Your Project\n\nOnce you have your submission ready in either an `.html` or `.zip` file format, go ahead and upload your project for review!", "nomination_eligible": false}}