{"status": "completed", "result": "failed", "grader_agent": "human", "id": 785075, "user_id": 147220, "notes": "At dishq we are building a personalised food discovery platform which can understand user taste and recommend dishes matching to their taste taking in various factors like food data, contextual and environmental.\r\n\r\nYou’ll be challenged to create innovative solutions using data across food science, math and user data to power our recommendation engine. Also, you’ll be given sole responsibility to build data pipelines using NLP techniques to make data inwarding efficient from various unstructured data sources.\r\n\r\nDesired Skills,\r\n\r\nStrong knowledge in computer science fundamentals, algorithms, mathematics, linear algebra, graph theory, probability and statistics.\r\nHands on experience in handling text data and NLP concepts and ML libraries. Proficient in python and using libraries -- nltk, sklearn, numpy, scipy, pandas, …\r\nComfortable with django framework.\r\nComfortable with web scraping, extracting, manipulating and analyzing complex, high-volume, high-dimensionality data from varying sources.\r\nStrong passion for data driven research for answering hard questions with data.\r\nAbility to communicate complex quantitative analysis in a clear, precise, and actionable manner.\r\nHaving good understanding of design principles.\r\nPassionate about startups and ability to work in fast paced environment.\r\nProblems you will be working on\r\n\r\nDevelop appropriate text analytics to automate labelling for unstructured data from different sources.\r\nBuild analytics to measure quality of results from user interaction data.\r\nConceptualize and develop novel techniques to understand food data and improve personalisation algorithm.\r\nA/B test various techniques/tunings to personalisation models.\r\nIntroduce self learning models based on various data points to improve accuracy of prediction.\r\nSkills\r\nPython, Machine Learning, Django, Probability & Statistics, NLP", "repo_url": null, "created_at": "2017-10-08T19:31:19.585Z", "updated_at": "2017-10-08T20:11:41.279Z", "commit_sha": null, "grader_id": 22779, "assigned_at": "2017-10-08T19:50:49.308Z", "price": "33.95", "completed_at": "2017-10-08T20:11:41.273Z", "archive_url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/785075/submission_content.zip", "zipfile": {"url": "https://udacity-reviews-uploads.s3.amazonaws.com/_submissions/zipfile/785075/submission_content.zip"}, "udacity_key": "6000409754861568", "held_at": null, "status_reason": null, "result_reason": null, "type": null, "training_id": null, "files": [], "url": null, "annotation_urls": [], "general_comment": "", "hidden": false, "previous_submission_id": null, "nomination": null, "language": "en-us", "rubric_id": 93, "is_training": false, "canary_metadata": null, "checkmate_metadata": null, "escalated_at": null, "ungradeable_tag": null, "project_id": 93, "user": {"name": "Sidharth", "udacity_key": "10691758082"}, "grader": {"name": "Joshua", "udacity_key": "5509512403"}, "project": {"id": 93, "name": "Interview Practice (Data Analyst)"}, "rubric": {"description": "The most effective interview skill is knowing how to make a case for yourself. If you don't have the experience, or even all the skills for the job, you can still demonstrate that you're a quick learner and deserve a chance. Interviewees need to demonstrate their passion for the job and connect their experiences, professional or not, and knowledge to what the job and company requires.", "nomination_eligible": false}}